<?xml version='1.0' ?><!DOCTYPE book PUBLIC "-//KDE//DTD DocBook V4.1-Based Variant V1.0//EN" "dtd/kde-next.dtd" [
  <!ENTITY kappname "&kde;" > <!-- replace kapp here. This only *seems* redundant -->
  <!ENTITY % addindex "IGNORE">
  <!ENTITY % English "INCLUDE" > <!-- change language only here -->
  <!ENTITY % ents SYSTEM "-//KDE//ENTITIES Documentation V2.0//EN">
  %ents;
]>
<!--Time-stamp: "2000-11-29 01:57:01 weetiong"-->

<book lang="&language;">

<bookinfo>
<title>&kde;: Die meistgestellten Fragen (FAQ)</title>

<authorgroup>
<author> <surname>Das KDE Team</surname> </author>
</authorgroup>

<copyright>
<year>1997</year>
<year>1998</year>
<year>1999</year>
<year>2000</year>
<holder>Das KDE Team</holder>
</copyright>

<legalnotice>&FDLNotice;</legalnotice>

<date>29/11/2000</date>
<releaseinfo>2.0.1</releaseinfo>

<abstract>
<para>Zusammenfassung der am meisten gestellten Fragen &uuml;ber KDE. Bitte teilen Sie alle Fehler, Ungenauigkeiten oder Auslassungen, die Sie in dieser <acronym>FAQ</acronym> finden, den Autoren unter der Adresse <email>kde-faq@kde.org</email> mit. Bitte stellen Sie dorthin aber keine Fragen, stellen Sie diese in einer der &kde;-Mailinglisten oder -Newsgroups.</para>
</abstract>

<keywordset>
<keyword>KDE</keyword>
<keyword>FAQ</keyword>
<keyword>Frage</keyword>
<keyword>Antwort</keyword>
</keywordset>
</bookinfo>

<chapter id="about">
<title>&Uuml;ber diese <acronym>FAQ</acronym></title>

<qandaset>
<qandaentry>
<question>
<para>Was k&ouml;nnen Sie tun, um bei dieser <acronym>FAQ</acronym> zu helfen?</para>
</question>
<answer>
<para>Erstens, schicken Sie eine E-Mail &uuml;ber alle Fehler, die Sie finden. Wir freuen uns auch ausdr&uuml;cklich &uuml;ber W&uuml;nsche und Anregungen. Noch besser, schicken Sie uns alles, von dem Sie denken, dass es unklar ist, oder sogar dazu, wie man es klar verst&auml;ndlich schreiben kann. Unsere E-Mail-Adresse ist <email>kde-faq@kde.org</email>.</para>
<para>Zweitens, schicken Sie uns Ihre L&ouml;sung f&uuml;r solche h&auml;ufig gestellten Fragen, die noch nicht in der <acronym>FAQ</acronym> beantwortet sind. Wir werden diese dann so bald wie m&ouml;glich aufnehmen.</para>
<para>Nicht zuletzt, nutzen Sie diese <acronym>FAQ</acronym>. Lesen Sie sie und andere wichtigen Dokumentationen gr&uuml;ndlich durch, bevor Sie Fragen an die verschiedenen &kde;-Mailinglisten und Newsgroups stellen.</para>
<para><note> <para>Wenn Sie eventuell ein <acronym>FAQ</acronym>-Betreuer werden wollen, dann finden Sie weitere Details in der n&auml;chsten Frage: <xref linkend="FAQ-maintainer-HOWTO"/>.</para> </note></para>
</answer>
</qandaentry>

<qandaentry>
<question id="FAQ-maintainer-HOWTO">
<para>Wie wird man <acronym>FAQ</acronym>-Betreuer?</para>
</question>
<answer>
<para>Dies ist ganz einfach. Schicken Sie uns einfach eine E-Mail an <email>kde-faq@kde.org</email>.</para>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="introduction">
<title>Einleitung</title>

<qandaset>
<qandaentry>
<question>
<para>Was ist &kde;?</para>
</question>
<answer>
<para>&kde; ist das K Desktop Environment. Es wurde 1996 von <ulink url="mailto:ettrich@kde.org">Matthias Ettrich</ulink> gestartet. Das Ziel des &kde;-Projektes ist, die St&auml;rken des &UNIX;-Betriebssystems mit dem Komfort einer modernen grafischen Nutzeropberfl&auml;che zu verbinden.</para>
<para>Kurz gesagt, &kde; bringt &UNIX; auf den Schreibtisch.</para>
<para>Weitere Informationen &uuml;ber &kde; finden Sie unter <ulink url="http://www.kde.org/whatiskde/index.html">Was ist &kde;?</ulink></para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Was bedeutet das K in &kde;?</para>
</question>
<answer>
<para>Es stand urspr&uuml;nglich f&uuml;r Kool. Sie finden hier: <ulink url="http://www.via.ecp.fr/lyx/archive/9610/msg00368.htm">die Mitteilung, mit der Alles anfing</ulink> .</para>
</answer>
</qandaentry>

<qandaentry>
<question id="platform">
<para>Auf welchen Systemen l&auml;uft &kde;?</para>
</question>
<answer>
<para>&kde; ist die Arbeitsfl&auml;che f&uuml;r alle &UNIX;. Es ist wahr, die meisten &kde;-Entwickler nutzen &Linux;, aber &kde; l&auml;uft sehr gut auf vielen Systemen. Es ist m&ouml;glich, dass Sie die Programmquellen ein wenig &auml;ndern m&uuml;ssen, um &kde; auf einer wenig verbreiteten Variante von &UNIX; zu kompilieren, oder wenn Sie nicht die &GNU;-Entwicklungsumgebung benutzen, besonders den &gcc;-Kompiler.</para>
<para>Einige der Systeme, auf denen &kde; l&auml;uft, sind:</para>
<itemizedlist> <listitem><para>&Linux;</para></listitem> <listitem><para>&Solaris;</para></listitem> <listitem><para>FreeBSD</para></listitem> <listitem><para>&IRIX;</para></listitem> <listitem><para>&HP-UX;</para></listitem> <listitem><para>MKLinux</para></listitem> <listitem><para>&LinuxPPC;</para></listitem> </itemizedlist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Ist &kde; ein Fenstermanager?</para>
</question>
<answer>
<para>Nein, &kde; ist kein Fenstermanager. &kde; enth&auml;lt einen weit entwickelten Fenstermanager (&kwm; in &kde; vor Version 2 und &kwin; ab &kde; Version 2), &kde; ist aber viel mehr als das. Es ist eine voll ausgebaute integrierte Arbeitsumgebung.</para>
<para>&kde; stellt eine komplette Arbeitsumgebung mit Dateimanager, Fenstermanager, Hilfesystem, Konfigurationssystem, anderen ungez&auml;hlten Dienstprogrammen und einer st&auml;ndig steigenden Anzahl an Anwendungen, z.B. Mail- und News-Clients, Zeichenprogrammen, &PostScript;- und &DVI;-Betrachtern und so weiter, bereit.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Ist &kde; ein <acronym>CDE</acronym>, &Windows; 95 oder &Mac; <acronym>OS</acronym> Clone?</para>
</question>
<answer>
<para>Nein, &kde; ist kein Clone, keine Nachbildung, besonders kein <acronym>CDE-</acronym> oder &Windows;-Clone. Die &kde;-Entwickler haben und werden weiterhin die besten Funktionen von allen vorhandenen Arbeitsumgebungen sammeln; aber &kde; ist eine wirklich einmalige Arbeitsumgebung, die weiter ihren eigenen Weg gehen wird.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Ist &kde; freie Software?</para>
</question>
<answer>

<para>Ja, &kde; ist freie Software unter den Bedingungen der &GNU; General Public License. Alle &kde;-Bibliotheken sind zum Erstellen von kommerzieller Software verf&uuml;gbar unter den Bedingungen der LGPL f&uuml;r die &kde;-Arbeitsumgebung, aber alle &kde;-Anwendungen sind lizensiert unter den Bedingungen der <acronym>GPL</acronym>.</para>
<para>&kde; nutzt den <link linkend="Qt">&Qt; C++ Crossplatform Toolkit</link>, der (seit Version 2.2) auch unter der <acronym>GPL</acronym> ver&ouml;ffentlicht ist.</para>
<para>Es ist absolut legal, &kde; und &Qt; auf einer freien &CD-ROM; zu ver&ouml;ffentlichen. Keine Geb&uuml;hren f&uuml;r Lizenzen irgendeiner Art sind hierf&uuml;r zu zahlen.</para>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="getting-kde">
<title>&kde; erhalten</title>

<qandaset>
<qandaentry>
<question id="where-to-get-kde">
<para>Wo bekommen Sie &kde;?</para>
</question>
<answer>
<para>Die Hauptseite f&uuml;r die &kde;-Verteilung ist <ulink url="ftp://ftp.kde.org">ftp.kde.org</ulink>. Durch die Popularit&auml;t von &kde; ist diese Seite aber oft stark belastet und langsam, Sie sollten deswegen auf eine der Spiegelseiten ausweichen. Eine aktuelle Liste der Spiegel finden Sie <ulink url="http://www.kde.org/mirrors.html">hier</ulink>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Gibt es &Linux;-Distributionen mit &kde;?</para>
</question>
<answer>
<para>Ja, gro&szlig;e &Linux;-Distributionen schlie&szlig;en &kde; schon ein. Da es aber Zeit braucht, eine Distribution zu erstellen, kann es sein, dass sie nicht immer die neueste Version enthalten, aber f&uuml;r den Start oder um das Herunterladen von gro&szlig;en Datenmengen aus dem Internet zu vermeiden, ist dies trotzdem ein guter Anfang.</para>
<para>Eine aktuelle Liste von Distributionen, die mit &kde; ausgeliefert werden, finden Sie unter: <ulink url="http://www.kde.org/kdeships.html">http://www.kde.org/kdeships.html</ulink>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Was ist die aktuelle Version?</para>
</question>
<answer>
<para>Die aktuelle stabile Version ist 2.0.1.</para>
<para>Die <ulink url="http://www.kde.org/info/2.0.html">&kde; 2.0 Info Page</ulink> enth&auml;lt viele Informationen &uuml;ber dieses lang erwartete Release.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wo finden Sie &kde;-Snapshots?</para>
</question>
<answer>
<para>Sie finden die aktuellsten Snapshots unter: <ulink url="ftp://ftp.kde.org/pub/kde/unstable/CVS/snapshots"> ftp://ftp.kde.org/pub/kde/unstable/CVS/snapshots</ulink>. Wenn Sie dar&uuml;ber nachdenken, Ihren eigenen <acronym>CVS</acronym>-Client einzurichten, um immer die letzten Snapshots zu haben, sehen Sie unter: <ulink url="http://www.kde.org/cvsup.html">How to use <application>cvsup</application> to get &kde;</ulink> nach. Dort finden Sie eine Anleitung</para>

<para>Wenn Sie bei der Gelegenheit wissen wollen, was <acronym>CVS</acronym> ist, sehen Sie unter <link linkend="CVS">Was ist <acronym>CVS</acronym>?</link> nach.</para>
</answer>
</qandaentry>

<qandaentry>
<question id="where-to-get-qt">
<para>Wo bekommen Sie &Qt;?</para>
</question>
<answer>
<para>&Qt; ist ein Produkt der norwegischen Firma Troll Tech. Sie finden die jeweils neueste &Qt;-Version auf deren <ulink url="ftp://ftp.troll.no">&FTP; server</ulink>.</para>
<para>Trotzdem sollten Sie &Qt; auch auf den oben genannten <link linkend="where-to-get-kde">&kde;-Seiten</link> finden. In den neuesten &Linux;-Distributionen ist &Qt; schon eingeschlossen. Bitte sehen Sie vorher unter <xref linkend="prerequisites"/> nach, welche Version von &Qt; Sie brauchen.</para>
</answer>
</qandaentry>

<!--throw this into the glossary as well? ;)  maybe not.-->
<qandaentry>
<question id="qt">
<para>Was ist &Qt;?</para>
</question>
<answer>
<para>&Qt; ist eine C++-basierte Klassenbibliothek zum Erstellen von graphischen Nutzerschnittstellen. Diese stellt die meisten Elemente, die Sie in &kde;-Anwendungen sehen, bereit: Men&uuml;s, Kn&ouml;pfe, Schieberegler, <abbrev>etc.</abbrev> &Qt; ist eine plattformunabh&auml;ngige Bibliothek, die es Ihnen gestattet, Programme zu schreiben, die sowohl unter &UNIX;-Systemen als auch unter &Windows; kompilieren. Weitere Informationen &uuml;ber &Qt; finden Sie unter <ulink url="http://www.troll.no">http://www.troll.no</ulink>.</para>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="install">
<title>Installationsanleitung</title>

<para>Hier ist die Installationsanleitung f&uuml;r &kde; 2.0. F&uuml;r sp&auml;tere Versionen lesen Sie bitte auch die Dateien <filename>README</filename> und <filename>INSTALL</filename>, die mit der Distribution ausgeliefert wurden. Bitte lesen Sie alle Anleitungen sorgf&auml;ltig und versuchen Sie, sich selbst zu helfen, wenn irgendetwas schiefgeht. Falls Sie weitere Unterst&uuml;tzung brauchen, versuchen Sie es in einer der &kde;-Mailinglisten oder einer der Newsgroups (Anleitung zur Nutzung der Mailinglisten finden Sie unter <ulink url="http://www.kde.org/contact.html">diesem Link</ulink>).</para>

<para>&kde; 2.0-Nutzer sollten unter <ulink url="http://www.kde.org/info/2.0.html">&kde; 2.0-Infoseite</ulink> f&uuml;r einige spezielle &kde; 2.0-Information nachsehen.</para>

<qandaset>
<qandaentry>
<question>
<para>An die eventuellen "&Uuml;berl&auml;ufer"</para>
</question>
<answer>
<para>Sie haben die Ger&uuml;chte geh&ouml;rt. Oder Sie haben die Bildschirmfotos gesehen. Und Sie sind ungeduldig &kde; auszuprobieren. Aber Sie wissen fast nichts &uuml;ber das <quote>alternative OS</quote>-Gesch&auml;ft. Macht nichts, Sie werden einiges lesen m&uuml;ssen, das ist Alles!</para>
<para>&kde; l&auml;uft nicht unter &Windows; 95/98/NT oder OS/2 (noch nicht). Sie m&uuml;ssen ein &UNIX;-System haben, um &kde; laufen zu lassen. Weitere Informationen hierzu finden Sie unter <xref linkend="platform"/>.</para>
<para>Nehmen wir an, Sie h&auml;tten sich entschlossen &Linux; zu installieren. Sie k&ouml;nnen es entweder aus dem Internet herunterladen oder einen Satz &CD-ROM;s kaufen, der die Distribution Ihrer Wahl enth&auml;lt. Die folgenden Links k&ouml;nnen Ihnen bei der Entscheidung und Installation eventuell von Nutzen sein:</para>
<itemizedlist> <listitem><para><ulink url="http://www.control-escape.com/">Control-Escape: Alternative Software, &Linux;-Hilfe</ulink></para></listitem> <listitem><para><ulink url="http://www.linuxdoc.org/">&Linux; Dokumentations Projekt</ulink></para></listitem> <listitem><para><ulink url="http://www.mainmatter.com/">&Linux; meist gestellte Fragen mit Antworten</ulink></para></listitem> <listitem><para><ulink url="http://www.linux.org/index.html">Die &Linux; Homepage bei &Linux; Online</ulink></para></listitem> <listitem><para>Usenet Newsgroups wie comp.os.linux.*</para></listitem> </itemizedlist>
<para>Um &kde; unter &Linux; zu betreiben, m&uuml;ssen Sie das &X; zuerst einrichten. &X; ist der de facto Standard f&uuml;r &GUI; auf &UNIX;-Systemen. Folgende Links sind m&ouml;glicherweise hierbei hilfreich:</para>
<itemizedlist> <listitem><para><ulink url="http://www.x.org/">X.org</ulink></para></listitem> <listitem><para><ulink url="http://www.xfree86.org/">XFree86(TM): Home Page</ulink></para></listitem> <listitem><para>Usenet Newsgroups wie comp.os.linux.x und comp.windows.x.*.</para></listitem> </itemizedlist>
<para>Endlich, Sie sind bereit, mit der &kde;-Installation zu beginnen. Fangen Sie mit dem Lesen des n&auml;chsten Abschnittes an. Um &kde; zu bekommen, sehen Sie unter <xref linkend="where-to-get-KDE"/> nach. Wenn Sie irgendwelche Probleme bei der &kde;-Installation haben, z&ouml;gern Sie nicht, sich an eine der &kde; <link linkend="mailing-lists">Mailinglisten</link> oder <link linkend="newsgroups">Newsgroups</link> zu wenden. Aber bedenken Sie: keine Frage ist zu dumm, gefragt zu werden, aber manche Fragen sind zu dumm zum Beantworten; besonders wenn die Antwort in dieser <acronym>FAQ</acronym> steht.</para>
<para>Viel Gl&uuml;ck und viel Spa&szlig;!</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Verf&uuml;gbare Paketformate</para>
</question>
<answer>

<para>Das &kde;-Team stellt sechs verschiedene Arten von Paketen bereit: Quellen- und bin&auml;re <acronym>RPM</acronym>-Pakete, Quellen- und bin&auml;re <filename>.tgz</filename> (<filename>.tar.gz</filename>) Dateien sowie Quellen- und bin&auml;re Debianpakete. Die ersten normalerweise fertiggestellten Pakete sind die Quellen im <filename>.tgz</filename> Format, aber die anderen Formate erscheinen kurz danach. Seit kurzem wurden auch Quellen und bin&auml;re Dateien im <filename>.tar.bz2</filename>-Format verf&uuml;gbar gemacht. F&uuml;r weitere Informationen, wie Sie Dateien mit der Endung <filename>.tar.bz2</filename> entpacken, sehen Sie unter <xref linkend="bzip2"/> nach. Zus&auml;tzlich wurden auch <filename>pkg</filename>-Pakete f&uuml;r &Solaris; 2.6 und 7 bereitgestellt.</para> 
<para>Die genaue Installation h&auml;ngt vom gew&auml;hlten Paketformat - und nat&uuml;rlich der Distribution - ab. Nach der Installation sind f&uuml;r alle Paketformate Nach-Installationsprozeduren abzuarbeiten. Beachten Sie, dass Sie als unerfahrener &UNIX;-Anf&auml;nger am besten beraten sind, wenn Sie bin&auml;re <acronym>RPM</acronym>- oder Debian-Pakete von Ihrem Distributionshersteller verwenden. Mindestens Caldera, Delix, und S.u.S.E. machen bin&auml;re <acronym>RPM</acronym>s auf ihren &FTP;-Servern verf&uuml;gbar.</para>
<para>Wenn Sie spezielle Optionen eingerichtet haben (z.B. wenn Sie versteckte Passw&ouml;rter haben und Bildschirmschoner benutzen wollen), dann ist es wahrscheinlich am besten, wenn Sie die Quellen benutzen und &kde; selbst kompilieren. <note><para><ulink url="mailto:bill.mote@bigfoot.com">Bill Mote</ulink> hat eine Homepage mit dem Namen "KDE 1.1 Installation via RPM". Diese finden Sie <ulink url="http://home.fuse.net/bmote/kde.htm">hier</ulink>.</para></note></para>
</answer>
</qandaentry>

<qandaentry>
<question id="prerequisites">
<para>Voraussetzungen</para>
</question>
<answer>
<para>F&uuml;r &kde; 2.0, brauchen Sie die &Qt; Bibliothek Version 2.2 oder h&ouml;her, f&uuml;r &kde; 1.1, &kde; 1.1.1, und &kde; 1.1.2, brauchen Sie Version 1.42 oder h&ouml;her. F&uuml;r &kde; 1.0, brauchen Sie &Qt; 1.33 oder h&ouml;her. Stellen Sie sicher, dass Sie die richtige &Qt; herunterladen. <caution>&kde; 1.x l&auml;uft nicht mit &Qt; 2.0 oder h&ouml;her.</caution> Sie brauchen zum Kompilieren au&szlig;erdem die Header-Dateien. Diese sind frei verf&uuml;gbar unter: <ulink url="http://www.trolltech.com/products/download"> http://www.trolltech.com/download</ulink>. Zus&auml;tzlich gibt es optionale Bibliotheken, die &kde; erweitern, wenn Sie diese auf Ihrem System installieren. Ein Beispiel ist die libssl, die verschl&uuml;sselte Verbindungen f&uuml;r &konqueror; erm&ouml;glicht.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Beschreibung der Pakete</para>
</question>
<answer>
<para>Die Distribution besteht zur Zeit aus elf Paketen. Manche davon sind notwendig, andere sind optional. Alle Pakete sind in allen oben aufgelisteten Formaten verf&uuml;gbar.</para>
<variablelist> <varlistentry> <term>kdesupport</term> <listitem> <para>Empfohlen</para> <para>Dieses Paket enth&auml;lt zus&auml;tzliche Bibliotheken, die nicht als Teil von &kde; geschrieben wurden, aber trotzdem gebraucht werden. Wenn diese Bibliotheken (libgif, libjpeg, libmime, libuu, libgdbm) in der geforderten Version schon vorhanden sind, dann brauchen Sie dieses Paket nicht zu installieren. Im Zweifelsfall installieren Sie es. Wenn Sie &kde; mit Debian-Paketen betreiben wollen, m&uuml;ssen Sie dieses Paket installieren.</para> </listitem> </varlistentry> <varlistentry> <term>kdelibs</term> <listitem> <para>Erforderlich</para> <para>Dieses Paket enth&auml;lt Bibliotheken, die von allen &kde;-Anwendungen gebraucht werden.</para> </listitem> </varlistentry> <varlistentry> <term>kdebase</term> <listitem> <para>Erforderlich</para> <para>Dieses Paket enth&auml;lt die Standardanwendungen, die den Kern der &kde;-Arbeitsumgebung bilden; den Fenstermanager, den Terminal-Emulator, das Kontrollzentrum, den Dateimanager und die Kontrollleiste.</para> </listitem> </varlistentry> <varlistentry> <term>kdegames</term> <listitem> <para>Optional</para> <para>Verschiede Spiele wie Mahjongg, Snake, Asteroids und Tetris.</para> </listitem> </varlistentry> <varlistentry> <term>kdegraphics</term> <listitem> <para>Optional</para> <para>Verschiedene graphische Programme wie ein Programm zum Anzeigen von &PostScript;- und &DVI;-Dateien und ein Zeichenprogramm.</para> </listitem> </varlistentry> <varlistentry> <term>kdeutils</term> <listitem> <para>Optional</para> <para>Verschiedene Schreibtischutensilien wie Taschenrechner, Editor und anderes.</para> </listitem> </varlistentry> <varlistentry> <term>kdemultimedia</term> <listitem> <para>Optional</para> <para>Multimediaanwendungen wie &CD;-Spieler und Mixer (Mischpult).</para> </listitem> </varlistentry> <varlistentry> <term>kdenetwork</term> <listitem> <para>Optional</para> <para>Netzwerkanwendungen. Zur Zeit enth&auml;t dieses Paket das E-Mail-Programm, den Newsreader und einige andere Programme zum Thema Netzwerke.</para> </listitem> </varlistentry> <varlistentry> <term>kdeadmin</term> <listitem> <para>Optional</para> <para>Systemverwaltungsprogramme.</para> </listitem> </varlistentry> <varlistentry> <term>kdetoys</term> <listitem> <para>Optional</para> <para>Nette Kleinigkeiten, Spielzeuge.</para> </listitem> </varlistentry> <varlistentry> <term>&korganizer;</term> <listitem> <para>Optional</para> <para>Kein Schreibtisch ist komplett ohne Organizer, richtig?</para> </listitem> </varlistentry> </variablelist>
<para>kdesupport (wenn notwendig) sollten Sie vor allen anderen Paketen installieren. Als n&auml;chstes (oder erstes) Paket sollte kdelibs installiert werden. Alle anderen Pakete k&ouml;nnen in beliebiger Reihenfolge installiert werden.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Installationsanleitung f&uuml;r die verschiedenen Paketformate</para>
</question>
<answer>
<para><important> <para>Lesen Sie unbedingt die Dateien <filename>README</filename> und <filename>INSTALL</filename>.</para> </important></para>
<variablelist> <varlistentry> <term>Installation von Debianpaketen</term> <listitem> <para>Die Debianpakete installieren sich entsprechend dem kommenden FHS (File Hierarchy Standard).</para> <procedure> <step performance="required"><para>Melden Sie sich mit Systemverwalterrechten an.</para></step> <step performance="required"><para>run <command>dpkg <option>-i <replaceable>packagename.deb</replaceable></option></command> for every package you want to install.</para></step> </procedure> </listitem> </varlistentry> <varlistentry> <term>Installation von <acronym>RPM</acronym> Paketen</term> <listitem> <procedure> <title>Installieren von bin&auml;ren <acronym>RPM</acronym>s</title> <step performance="required"><para>Melden Sie sich mit Systemverwalterrechten an.</para></step> <step performance="required"><para>F&uuml;hren Sie den folgenden Befehl aus: <command>rpm <option>-ivh <replaceable>packagename.rpm</replaceable></option></command></para></step> </procedure> <procedure> <title>Erzeugen und Installieren eines bin&auml;ren <acronym>RPM</acronym>-Paketes aus Quellen</title> <step performance="required"><para>Melden Sie sich mit Systemverwalterrechten an.</para></step> <step performance="required"><para>F&uuml;hren Sie folgendene Befehle aus: <command>rpm <option>-ivh <replaceable>packagename.src.rpm</replaceable></option></command></para></step> <step performance="required"><para><command>cd /usr/src/redhat/SPECS</command></para></step> <step performance="required"><para><command>rpm <option>-bb <replaceable>packagename.spec</replaceable></option></command></para></step> <step performance="required"><para><command>cd ../RPMS/<replaceable>i386</replaceable></command> (f&uml;r welche Architektur Sie nutzen)</para></step> <step performance="required"><para><command>rpm <option>-ivh <replaceable>packagename.i386.rpm</replaceable> </option></command></para></step> </procedure> </listitem> </varlistentry> <varlistentry> <term>Installation von Quellen <filename>.tar.gz</filename>-Dateien</term> <listitem> <para>Die Quellen <filename>.tgz</filename>-Pakete installieren sich standardm&auml;&szlig;ig in das Verzeichnis <filename class="directory">/usr/local/kde</filename>. Dies k&ouml;nnen Sie manuell ver&auml;ndern, indem Sie die <option>--prefix</option> Option des "<filename>configure</filename>"-Skripts benutzen.</para> <procedure> <step performance="required"><para>Entpacken Sie die Pakete mit <command>tar <option>xvzf <replaceable>packagename.tar.gz</replaceable></option></command></para></step> <step performance="required"><para>Wechseln Sie in das Verzeichnis des Paketes: <command>cd <replaceable>packagename</replaceable></command></para></step> <step performance="required"><para>Konfigurieren Sie das Paket mit: <command>make</command> <note><para>Einige Pakete (vor allem kdebase) haben spezielle Optionen, die f&uuml;r Ihre Installation notwendig sein k&ouml;nnen. Geben Sie <command>./configure <option>--help</option></command> ein, um die vorhandenen Optionen angezeigt zu bekommen.</para></note></para></step> <step performance="required"><para>Erstellen Sie das Paket mit: <command>make</command></para></step> <step performance="required"><para>Installieren Sie das Paket mit <command>su <option>-c "make install"</option></command> (Wenn Sie noch nicht mit Systemverwalterrechten angemeldet sind). Wenn Sie schon als Systemverwalter angemeldet sind, dann geben Sie ein: <command>make<option> install</option></command>.</para></step> </procedure> </listitem> </varlistentry> <varlistentry> <term>Installation von bin&auml;ren <filename>.tar.gz</filename> Dateien</term> <listitem> <para>Die bin&auml;ren .tar.gz Pakete installieren sich in das Verzeichnis <filename class="directory">/opt/kde</filename>.</para> <procedure> <step performance="required"><para>Melden Sie sich mit Systemverwalterrechten an.</para></step> <step performance="required"><para><command>cd /</command></para></step> <step performance="required"><para><command>tar <option>xvzf <replaceable>packagename.tar.gz</replaceable></option></command></para></step> </procedure> </listitem> </varlistentry> </variablelist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Nach-Installations Prozeduren</para>
</question>
<answer>
<para>Stellen Sie zuerst sicher, dass das bin&auml;re &kde;-Installationsverzeichnis (<abbrev>z.B.</abbrev> <filename class="directory">/opt/kde/bin</filename>) zu Ihrem <envar>PATH</envar> und das &kde;-Library-Installationsverzeichnis zu Ihrem <envar>LD_LIBRARY_PATH</envar> hinzugef&uuml;gt wurde. Dies gilt nur f&uuml;r Systeme, die rpath nicht unterst&uuml;tzen; auf &Linux; &ELF;, sollte es auch ohne dieses Hinzuf&uuml;gen funktionieren. Diese Umgebungsvariable kann auf verschiedenen Systemen unterschiedlich bezeichnet sein; <abbrev>z.B.</abbrev> sie hei&szlig;t <envar>SHLIB_PATH</envar> auf &IRIX;. Setzen Sie die Umgebungsvariable <envar>KDEDIR</envar> dann auf die Basis Ihres &kde;-Verzeichnisbaumes, <abbrev>z.B.</abbrev> <filename class="directory">/opt/kde</filename>. <caution> <para>Please bear in mind that it is unwise to set <envar>LD_LIBRARY_PATH</envar> blindly. In the vast majority of cases it is unnecessary and can do more harm than good. There is a web page written by <ulink url="mailto:barr@cis.ohio-state.edu">Dave Barr</ulink> explaining the evils of <envar>LD_LIBRARY_PATH</envar> and it can be found at <ulink url="http://www.cis.ohio-state.edu/~barr/ldpath.html">http://www.cis.ohio-state.edu/~barr/ldpath.html</ulink>.</para> </caution> </para>
<para>Auch wenn Sie die meisten &kde;-Anwendungen einfach durch Aufrufen beim Namen benutzen k&ouml;nnen, profitieren Sie von &kde;'s weitentwickelten Eigenschaften nur, wenn Sie den &kde;-Fenstermanager und dessen Hilfprogramme benutzen.</para>
<para>Um Ihnen dies so einfach wie m&ouml;glich zu machen, stellt &kde; ein einfaches Skript mit dem Namen <command>startkde</command> bereit, welches im <filename class="directory">$<envar>KDEDIR</envar>/bin</filename>-Verzeichnis installiert wird und damit in Ihrem Pfad vorhanden ist.</para>
<para>Editieren Sie die Datei <filename>.xinitrc</filename> in Ihrem Pers&ouml;nlichen Verzeichnis (machen Sie vorher eine Sicherungskopie!), entfernen Sie alles, was wie ein Fenstermanageraufruf aussieht und setzen Sie daf&uuml;r <command>startkde</command> ein. Starten Sie &X; neu. Wenn Sie &kdm;/ <application>xdm</application> nutzen, m&uuml;ssen Sie die Datei <filename>.xsession</filename> anstelle von <filename>.xinitrc</filename> editieren. Wenn Sie kein <filename>.xinitrc</filename> oder <filename>.xsession</filename> in Ihrem Pers&ouml;nlichen Verzeichnis haben, dann erzeugen Sie einfach eine neue Datei, die nur eine Zeile "<command>startkde</command>" enth&auml;lt. <note> <para>Some systems (notably &RedHat; &Linux;) use <filename>.Xclients</filename> instead.</para> </note></para>
<para>Jetzt sollten Sie eine neue gl&auml;nzende &kde;-Arbeitsoberfl&auml;che sehen. Beginnen Sie nun mit der Erforschung der wunderbaren Welt von &kde;. Wenn Sie erst einiges an Dokumentation lesen wollen, finden Sie hier eine als sehr gut bekannte <ulink url="http://www.kde.org/documentation/quickstart/index.html">Schnellstartanleitung</ulink>. Weiterhin hat jede Anwendung eine Onlinehilfe, die Sie &uuml;ber das Hilfemen&uuml;aufrufen k&ouml;nnen.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Da diese Frage nicht mehr aktuell ist, wurde sie noch nicht uebersetzt.</para>
</question>
<answer>
<para><ulink url="mailto:berry@ieeecs.concordia.ca">Chris Berry</ulink> posted the following updated micro-HOWTO (edited for layout) to comp.windows.x.kde.</para>
<para>This is a (blatant) modification of the original Micro-HOWTO posted by <ulink url="mailto:sterritt@mrj.com">Chris Sterritt</ulink>. This is valid for &kde;-1.1.1 running on &IRIX; 6.5. I haven't attempted it on other platforms. There are some items of contention: I get many, many warnings about &Qt; definitions being preempted, about libkdecore definitions being preempted, <abbrev>etc.</abbrev> (So many definitions have been preempted I could have written a dictionary), the i18n stuff doesn't work (while it did in v1.0) and &kikbd; chokes in &konsole; (it works fine otherwise). Any comments or questions can be directed to <email>berry@ieeecs.concordia.ca</email>. I will also keep a copy of this HOWTO on my personal web-page: <ulink url="http://alcor.concordia.ca/~c_berry/">http://alcor.concordia.ca/~c_berry/</ulink>.</para>
<para>Also, if this isn't your cup of tea, I have uploaded binaries of kde-1.1.1 and egcs-1.1.2 to <ulink url="ftp://ftp.cmc.ec.gc.ca/pub/hbc/sgi/">ftp://ftp.cmc.ec.gc.ca/pub/hbc/sgi/</ulink>. &kde; has been compiled with shared libraries, so if you don't have libstdc++.so.2.9.0 I would suggest downloading the egcs binary as well. Please also download and <emphasis>read</emphasis> the README in the directory, as it contains important installation information.</para>
<para>Finally, neither I nor Environment Canada accept any responsibility vis a vis the worthiness of these instructions. They have worked for me. If they work for you, that's good, if they don't work, I can't help you, neither can anybody at EC. Note that several things don't work the way they are supposed to work. If you find a way around these problems, let someone else know. I personally won't be able to test any fixes after August 20, 1999 as I will be returning to school (and using SunOS). </para>
<para>Enjoy!</para>

<procedure> <title>Compiling &kde; 1.1.1 on &SGI; &IRIX; 6.x</title> <step performance="required"> <para>Install &Qt; 1.42 or higher</para> </step> <step performance="required"> <para> I am installing &kde; as me (not root) so I have a <envar>KDEDIR</envar> environmental variable which is set to something other than /usr/local/ or whatever is the default. So I'll mention it below, but you may not have to. Also, &SGI; has a jpeg and a png library, but they're out of date or otherwise wrong. So you'll have to track down the libpng and libz sources (jpeg comes in kdesupport); I found them as source <acronym>RPM</acronym>s in one of the &RedHat; &FTP; mirrors.</para> </step> <step performance="required"> <para> Get <application>egcs</application> 1.1.1 or later and compile it with <option>-fsquangle</option> support on. This is because &SGI;'s assembler can't handle the huge object names produced by normal <application>g++</application>, and <application>gas</application> doesn't evidently work yet for &SGI;s. You'll have to build &gcc;'s libraries using this binary as well. Make sure your <envar>PATH</envar> gets this compiler only (if you have another &gcc; installed somewhere). When I do a <command>g++ <option>-v</option></command> I get:</para> <screen><computeroutput>gcc version egcs-2.91.60 19981201 (egcs-1.1.1 release)</computeroutput>
</screen> </step> <step performance="required"> <para> Do a <command>setenv <option>LDFLAGS " "</option></command> because the configure scripts insist on trying <command>g++ <option>-s</option></command> when compiling a test program, which always fails on the &SGI;s.</para> </step> <step performance="required"> <para> Unpack "kdesupport" and enter its directory. Run its configure with <option>--prefix</option> if you need to:</para> <screen>./configure --prefix=$KDEDIR --x-includes=/usr/include/X11 \
--x-libraries=/usr/lib32 --with-qt-includes=/opt/kde-1.1.1 \
--with-qt-libs=/opt/kde-1.1.1 --enable-shared
</screen> <para>Modify this to reflect your reality. In my case, I have &Qt; stuck in the same dir as &kde;, so I had to explicitly name the includes and libs dir. Sometimes the configure will still not see the &Qt; includes dir. Source your <filename>.login</filename> file to correct this (You did set up your <filename>.login</filename> file as the instructions in the &Qt; installation asked?).</para> </step> <step performance="required"> <para> Run the script (which I'll include below) as follows:</para> <screen><command>find <option>. -name Makefile -exec ../FixMakesSq {} \;</option></command></screen> <para>This fixes all the compile lines so that all the "replicated" libraries (jpeg and png) are replaced with full paths so they won't be linked with the &SGI; ones.</para> <note><para>In the original HOWTO, <option>-fsquangle</option> was added to each makefile. This caused compilation errors. I found that it was really only needed in one makefile. It will be noted below.</para> </note> <para>Here's the FixMakesSq script:</para> <programlisting>#!/bin/perl -ni.bak
 
if ((/-lpng/) || (/-ljpeg/))
{
    if (/^(.*)-lpng(.*)$/)
    {
        $b4 = $1;
        $af = $2;
        print "$b4 /path/to/KDE/libs/libpng.a $af\n";
    }
    if (/^(.*)-ljpeg(.*)$/)
    {
        $b4 = $1;
        $af = $2;
        print "$b4 /path/to/KDE/libs/libjpeg.a $af\n";
    }
}
        
#NOTE!! Uncomment this section if you want to add
#-D_LANGUAGE_C_PLUS_PLUS to all 
#makefiles.  I personally have not tried this, but it should not break 
#anything.
# Alternately, add the flag in the places noted below.

#elsif (/cxxflags\s*=(.*)$/i)
#{
#    print "CXXFLAGS =  -D_LANGUAGE_C_PLUS_PLUS $1\n";
#}
else
{
    print;
}
</programlisting> <para> Do:</para> <screen><command>gmake</command>
<command>gmake <option>install</option></command>
</screen> </step> <step performance="required"> <para> Go to the <filename>libz</filename> source directory, do:</para> <screen><command>./configure <option>--prefix=$KDEDIR</option></command>
<command>gmake</command>
<command>gmake install</command>
</screen> </step> <step performance="required"> <para> Go to the <filename>libpng</filename> source directory, do:</para> <screen><command>./configure <option>--prefix=$KDEDIR</option></command>
<command>gmake</command>
<command>gmake <option>install</option></command>
</screen> </step> <step performance="required"> <para> Unpack kdelibs and enter its directory. Note the <option>--enable-new-stuff</option> argument to <command>./configure</command> (this might not be needed, but nothing complains if you use it): </para> <screen><command>./configure <option>--prefix=$KDEDIR --x-includes=/usr/include/X11 \
--x-libraries=/usr/lib32 --with-qt-includes=/opt/kde-1.1.1 \
--with-qt-libs=/opt/kde-1.1.1 --enable-shared --enable-new-stuff</option></command>
<command>find <option>. -name Makefile -exec ../FixMakesSq {} \;</option></command>
</screen> </step> <step performance="required"> <para>Find <filename>kprocctrl.cpp</filename>, and fix the <filename>Makefile</filename> in that directory. Only if you did not uncomment the section that accomplishes this in the FixMakesSq script, add <option>-D_LANGUAGE_C_PLUS_PLUS</option> to the CXXFLAGS line. This makes it get the right definition for signal functions (has an int arg).</para> </step> <step performance="required"> <para> Find <filename>addressbook.cc</filename>, and fix the <filename>Makefile</filename> in that directory. Add <option>-fsquangle</option> to the CXXFLAGS line. This makes it able to handle the huge name that's going to pop out.</para> <screen><command>gmake</command>
<command>gmake <option>install</option></command>
</screen> </step> <step performance="required"> <para> Unpack kdebase and enter its directory. Do:</para> <screen><command>./configure <option>--prefix=$KDEDIR  --x-includes=/usr/include/X11 \
--x-libraries=/usr/lib32 --with-qt-includes=/opt/kde-1.1.1 \
--with-qt-libs=/opt/kde-1.1.1 --enable-shared </option></command>
<command>find <option>. -name Makefile -exec ../FixMakesSq {} \;</option></command>
</screen> </step> <step performance="required"> <para> Fix <filename>memory_sgi.cpp</filename> (do a find from <filename>kdebase</filename> directory). I just #ifdef'd out the contents of the whole function... it doesn't compile on my machine, and I never open that part of &kpanel; anyway :-).</para> </step> <step performance="required"> <para> Fix <filename>TEShell.C</filename> (in <filename>kdebase-1.1.1/konsole/src/</filename> directory). It is the operation for getting a pty for the new &konsole;. Alas, it was not written with &IRIX; in mind, and needs to be patched with the diff included below:</para> <programlisting>*** TEShell.C   Mon Apr 12 00:12:37 1999
--- /users/dor/aspg/ber/data/kdedown/kdebase-1.1.1/konsole/src/TEShell.C
Wed Jul 14 15:15:35 1999
***************
*** 169,174 ****
--- 169,177 ----
    pid_t pid = waitpid(-1,&amp;status,WNOHANG);
    Shell* sh = shells.find(pid);
    if (sh) { shells.remove(pid); sh-&gt;doneShell(status); }
+ #if defined(sgi)
+   signal(SIGCHLD,catchChild);
+ #endif
  }
  
  void Shell::doneShell(int status)
***************
*** 234,239 ****
--- 237,252 ----
        }
      }
    }
+ #endif
+ 
+ #if defined(sgi) /* Irix */
+  
+   needGrantPty = FALSE;
+   char* line;
+   line = _getpty(&amp;ptyfd, O_RDWR|O_NDELAY, 0600, 0);
+   strcpy(ptynam,"/dev/ptc");
+   strcpy(ttynam,line);
+  
  #endif
  
    if (ptyfd &lt; 0) // Linux, FIXME: Trouble on other systems?
</programlisting> <para>Then: </para> <screen><command>gmake</command>
<command>gmake <option>install</option></command>
</screen> </step> <step performance="required"> <para> Unpack kdeutils.</para> <screen><command>./configure <option>--prefix=$KDEDIR  --x-includes=/usr/include/X11 \
--x-libraries=/usr/lib32 --with-qt-includes=/opt/kde-1.1.1 \
--with-qt-libs=/opt/kde-1.1.1 --enable-shared </option></command>
<command>find <option>. -name Makefile -exec ../FixMakesSq {} \;</option></command>
</screen> </step> <step performance="required"> <para> Find <filename>kcalc_core.cpp</filename> and fix its <filename>Makefile</filename> like you did for <filename>kprocctrl.cpp</filename> above. </para> <screen>gmake
gmake install
</screen> </step> <step performance="required"> <para> Unpack kdegames, kdegraphics, and kdetoys and for each one, enter its directory and do: </para> <screen><command>./configure <option>--prefix=$KDEDIR  --x-includes=/usr/include/X11 \
--x-libraries=/usr/lib32 --with-qt-includes=/opt/kde-1.1.1 \
--with-qt-libs=/opt/kde-1.1.1 --enable-shared</option></command>
<command>find <option>. -name Makefile -exec ../FixMakesSq {}</option></command>
<command>gmake</command>
<command>gmake <option>install</option></command>
</screen> </step> <step performance="required"> <para> This step is optional for &kde;-1.1. I don't think it is necessary for &kde;-1.1.1. &knotes; has never crashed on me. I have left it here for completeness . Find where the <filename>knotes</filename> directory is. Go there, do a <command>make <option>clean</option></command>, then change the CXXFLAGS in its <filename>Makefile</filename>. The CXXFLAGS line has <option>-O2</option>, change that to <option>-g</option>. Then do a <command>make</command> and <command>make <option>install</option></command>. The reason for this is that I found &knotes; crashed within a few minutes of it starting up; however, when I recompiled it with <option>-g</option> (<abbrev>i.e.</abbrev> debugging support) instead of <option>-O2</option> (optimization) it ran fine. Go figure :-). </para> </step> </procedure>
<para>And that's it. You should now be able to run &kde;.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Sollen Sie die alte Version xyz entfernen, bevor Sie eine neue installieren?</para>
</question>
<answer>
<para>Im Prinzip ist dies nicht n&ouml;tig. <acronym>RPM</acronym> und Debian-Pakete sollten sich um alle Abh&auml;ngigkeiten k&uuml;mmern.</para>
<para>Wenn Sie den Quellcode selbst kompilieren, sorgen Sie daf&uuml;r, dass Sie nicht unterschiedliche Versionen von &kde; Paketen vermischen. Wenn Sie eine neue Version installieren, erstellen und installieren Sie zuerst kdesupport, dann kdelibs, dann kdebase.</para>
<para>Eins sollten Sie vermeiden: Installieren von zwei oder mehr Versionen von &kde; parallel. Dies kann passieren, wenn Sie unterschiedliche Zielverzeichnisse f&uuml;r verschiedene Versionen angeben. Die Ergebnisse sind dabei nicht vorhersagbar. Dasselbe trifft zu, wenn Sie verschiedene Versionen von &Qt; zur selben Zeit installiert haben. Das kann leicht passieren, wenn Sie schon eine &auml;ltere Version von &Qt; zusammen mit einer &Linux;distribution installiert haben.</para>
<!--create a new entry called "how to make KDE 1.x coexist with KDE 2"
and link it from here-->
</answer>
</qandaentry>

<qandaentry>
<question id="startkde">
<para>Wie starten Sie &kde;?</para>
</question>
<answer>
<para>Die komfortabelste Methode &kde; zu starten, ist die Nutzung des <filename>startkde</filename> Skriptes. Schreiben Sie einfach eine Zeile <command>startkde</command> an das Ende Ihrer <filename>.xsession</filename> Datei (oder Ihrer <filename>.xinitrc</filename> oder <filename>.Xclients</filename> Datei, wenn Sie &kdm; oder <application>xdm</application> nicht benutzen). Entfernen Sie auch alle Zeilen, die Ihren fr&uuml;heren Fenstermanager aktivieren. Wenn Sie keine <filename>.xsession</filename>, <filename>.xinitrc</filename>, oder <filename>.Xclients</filename> Datei in Ihrem Pers&ouml;nlichen Verzeichnis haben, erstellen Sie einfach eine neue, die nur eine Zeile mit dem Befehl <command>startkde</command> enth&auml;lt.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Immer, wenn Sie &kde; starten, bekommen Sie eine Fehlermeldung &uuml;ber "Schattenpassw&ouml;rter". Warum?</para>
</question>
<answer>
<para>Wenn Ihr System Schattenpassw&ouml;rter verwendet, kann der Bildschirmschoner nur dann richtig arbeiten, wenn das suid Bit gesetzt ist. Dieses gibt dem Bildschirmschoner Systemverwalterrechte, die er braucht, um auf die Schattenpassw&ouml;rter zuzugreifen. <caution><para>The screensavers might be configured to secure the machine until the password is entered.</para></caution></para>
<procedure> <title>Setzen des suid Bits f&uuml;r die Bildschirmschoner.</title> <step performance="required"><para>Melden Sie sich mit Systemverwalterrechten an</para></step> <step performance="required"><para><command>chown root $<envar>KDEDIR</envar>/bin/*.kss</command></para></step> <step performance="required"><para><command>chmod u+s $<envar>KDEDIR</envar>/bin/*.kss</command></para></step> </procedure>
<para>Alternativ dazu k&ouml;nnen Sie, wenn Sie &kde; von Quellen kompilieren, den Befehl <command>./configure <option>--with-shadow</option></command> benutzen, um kdebase zu konfigurieren. Dann wird das suid Bit f&uuml;r die notrwendigen Dateien automatisch w&auml;hrend der Installation mit dem Befehl <command>make install</command> gesetzt.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Ist es m&ouml;glich, &kde; in ein Nutzerverzeichns zu installieren?</para>
</question>
<answer>
<para>Ja, Sie k&ouml;nnen &kde; in irgendein Verzeichnis Ihrer Wahl installieren. Was hierbei zu beachten ist, h&auml;ngt von der Art der Pakete ab, die Sie installieren wollen:</para>
<procedure><title>Quellenpakete</title> <step performance="required"><para>Konfigurieren und Installieren Sie das Paket mit: <command>configure <option>--prefix=<replaceable>/users/myhome/kde</replaceable></option>; make; make install</command> zum Installieren in <filename class="directory">/users/myhome/kde</filename>.</para></step> <step performance="required"><para>F&uuml;gen Sie folgendes zu Ihren Initdataeien hinzu. Beachten Sie bitte, dass es meist nicht n&ouml;tig ist, die Umgebungsvariable <envar>LD_LIBRARY_PATH</envar> zu setzen, es ist meistens besser dies nicht zu tun.</para> <para>F&uuml;r csh oder tcsh:</para> <programlisting>
setenv KDEDIR /users/myhome/kde

if ( $?LD_LIBRARY_PATH ) then
   setenv LD_LIBRARY_PATH $KDEDIR/lib:$LD_LIBRARY_PATH
else
   setenv LD_LIBRARY_PATH $KDEDIR/lib
endif

if ( ! $?LIBRARY_PATH ) then
   setenv LIBRARY_PATH $LD_LIBRARY_PATH
endif  
</programlisting> <para>F&uuml;r die <application>bash</application>:</para> <programlisting>
KDEDIR=/users/myhome/kde
PATH=$KDEDIR/bin:$PATH
LD_LIBRARY_PATH=$KDEDIR/lib:$LD_LIBRARY_PATH
LIBRARY_PATH=$LD_LIBRARY_PATH
export KDEDIR PATH LD_LIBRARY_PATH LIBRARY_PATH
</programlisting></step> </procedure>
<procedure><title><acronym>RPM</acronym> Pakete</title> <step performance="required"><para><command>rpm</command> gestattet Ihnen, die Option <option>--prefix</option> zur Auswahl des Verzeichnisses, in das Sie installieren wollen, zu benutzen. <abbrev>z.B.</abbrev> der Befehl <command>rpm <option>-i --prefix=<replaceable>/users/myhome/kde package.rpm</replaceable></option></command> installiert das Paket in das Verzeichnis <filename class="directory">/users/myhome/kde</filename>.</para></step> </procedure>
<para><note> <para>Auch wenn &kde; von einem Nutzerverzeichnis l&auml;uft, gibt es einige Probleme mit Programmen, die Systemverwalterrechte ben&ouml;tigen; <abbrev>z.B.</abbrev> die Programme im kdeadmin Paket. Aber weil diese normalerweise nicht von Nutzern benutzt werden, ist dies eigentlich kein Problem.</para> <para>However, on systems using shadow passwords, the screensavers have to be suid root to enable password access for unlocking the screen, so this option will not work.</para> </note></para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para><command>startkde</command> bricht mit der Fehlermeldung <errorname>"can not connect to X server"</errorname> ab. Was ist falsch?</para>
</question>
<answer>
<para>Wahrscheinlich haben Sie versucht, den X Server mit dem Befehl <command>startkde</command> zu starten. Der X-Server wird mit dem Befehl <command>startx</command> gestartet. <command>startkde</command> ist das Skript, das von Ihrer <filename>.xinitrc</filename>, <filename>.xsession</filename>, oder <filename>.Xclients</filename> gestartet werden sollte, um den Fenstermanager und die notwendigen Server-D&auml;monenx f&uuml;r &kde; zu starten. Weitere Informationen hierzu finden Sie unter: <xref linkend="startkde"/>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Installieren von Debian Paketen mit <command>dpkg</command> gibt eine Fehlermeldung <errorname>"giflib2 is missing"</errorname> zur&uuml;ck</para>
</question>
<answer>
<para>Manchmal, wenn Sie &kde;-Debianpakete installieren, gibt <command>dpkg</command> eine Fehlermeldung <errorname>dependency problems: giflib2 is missing</errorname> zur&uuml;ck. Weil die giflib2 nicht gebraucht wird, ist die L&ouml;sung einfach: <command>dpkg <option>-i --ignore-depends=giflib2 <replaceable>package.deb</replaceable></option></command> </para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>&kde; auf &AIX;?</para>
</question>
<answer>
<para>Wenn Sie Schwierigkeiten haben, &kde; unter &AIX; zu kompilieren, sehen Sie auf Stefan Westerfeld's Webseite <ulink url="http://space.twc.de/~stefan/kde/aix.html">Running &kde; on Aix</ulink> nach. Dort finden Sie jede Menge Hilfe &uuml;ber das Erstellen von &kde; auf dieser au&szlig;ergew&ouml;hnlichen &UNIX;-Variante nach.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Installieren von &RedHat;-Paketen gibt eine Fehlermeldung <errorname>"libncurses.so.3.0 is needed"</errorname> aur&uuml;ck</para>
</question>
<answer>
<para>Installieren Sie diese Bibliothek. Wenn auf Ihrer &RedHat; &CD-ROM;, kein rpm-Paket daf&uuml;r ist, suchen Sie auf der &RedHat; &FTP; Seite und deren Mirrors. Dort sollten Sie das Paket finden. Beachten Sie, dass libncurses-3 und -4 ohne Probleme zusammen existieren k&ouml;nnen, so dass Sie nicht die eine mit der anderen ersetzen m&uuml;ssen, also ist hier ein einfaches <command>rpm -i</command> vollkommen ausreichend.</para>
<para>>Sie k&ouml;nnen auch folgendes probieren (mit Systemverwalterrechten):</para>
<procedure> <step performance="required"><para><command>cd /usr/lib</command></para></step> <step performance="required"><para><command>ln <option>-s libncurses.so.4 libncurses.so.3</option></command></para></step> <step performance="required"><para><command>ldconfig</command></para></step> </procedure>
<para>Weil libncurses-3 und -4 auf Bin&auml;r- und Quellenniveau 100% kompatibel sind, ist das Installieren von beiden nur ein Verschwenden von Platz.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>&kde; auf einem Laptop?</para>
</question>
<answer>
<para>Wenn Sie &X; zum Laufen bekommen, sollten Sie keine Probleme haben, auch &kde; zum Laufen zu bringen. Zus&auml;tzlich k&ouml;nnen folgende Links hilfreich sein:</para>
<itemizedlist> <listitem> <para><ulink url="http://www.cs.utexas.edu/users/kharker/linux-laptop/">http://www.cs.utexas.edu/users/kharker/linux-laptop/</ulink></para> </listitem> <listitem> <para><ulink url="http://www.yy.cs.keio.ac.jp/~sanpei/how2800x600.html">http://www.yy.cs.keio.ac.jp/~sanpei/how2800x600.html</ulink></para> </listitem> </itemizedlist>
<para>F&uuml;r Laptops mit exotischer Aufl&ouml;sung wie 1024x600, versuchen Sie, die <filename>XF86Config</filename> Datei (in <filename class="directory">/etc/X11</filename> wenn Sie &RedHat; nutzen) zu editieren. Wenn Sie ein wenig Erfahrung mit dieser Datei haben, wissen Sie, dass verschiedene "Modeline"-Zeilen darin sind. Sie m&uuml;ssen nur eine Zeile f&uuml;r Ihre Aufl&ouml;sung hinzuf&uuml;gen. Leider ist das Format der Modelines ziemlich esoterisch, so dass Sie eine Menge zu lesen haben, um es zu verstehen. Eine Informationsquelle ist die <ulink url="http://sunsite.unc.edu/LDP/HOWTO/XFree86-Video-Timings-HOWTO.html">XFree86 Video Timings HOWTO</ulink>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie k&ouml;nnen Sie das Standard-&kde;-Verzeichnis nach der Installation verschieben, ohne irgendetwas zu st&ouml;ren?</para>
</question>
<answer>
<para>Angenommen, das Standardverzeichnis ist <filename class="directory">/opt/kde</filename> und Sie wollen es nach <filename class="directory">/usr/local/kde</filename> verschieben, m&uuml;ssen Sie folgendes tun:</para>
<procedure> <step performance="required"><para>Melden Sie sich mit Systemverwalterrechten an</para></step> <step performance="required"><para><command>mv /opt/kde /usr/local/kde</command></para></step> <step performance="required"><para><command>ln -s /usr/local/kde /opt/kde</command></para></step> </procedure>
<para>Das verschiebt alle Ihre &kde;-Dateien nach <filename class="directory">/usr/local/kde</filename> aber alle sind weiterhin zugreifbar von <filename class="directory">/opt/kde</filename>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wo ist das Snapshot Konfigurationsskript geblieben?</para>
</question>
<answer>
<para>Es ist m&ouml;glich, dass dieses Problem schon in Ordnung gebracht wurde, aber im Fall es ist noch nicht, hier die L&ouml;sung: <command>make <option>-f admin/Makefile.common cvs</option></command></para>
</answer>
</qandaentry>

<qandaentry>
<question id="bzip2">
<para>Wie entpacken Sie Dateien mit bz2-Erweiterung?</para>
</question>
<answer>
<para>Sie brauchen das bzip2-Paket. Sie bekommen dieses von Ihrer bevorzugten &FTP;-Seite, wenn Sie es noch nicht haben. Zum Ansehen des Inhaltes der .bz2-Datei nutzen Sie folgenden Befehl: <command>bzip2 -cd <replaceable>files.tar.bz2</replaceable> | tar tvf -</command>. Zum Entpacken nutzen Sie den folgenden Befehl: <command>bzip2 -cd <replaceable>files.tar.bz2</replaceable> | tar xvf -</command>. Wenn Ihr <application>tar</application> das unterst&uuml;tzt, k&ouml;nnen Sie auch folgendes benutzen <command>tar --use-compress-program bzip2 -xvf <replaceable>files.tar.bz2</replaceable></command>. Nutzen Sie <command>man tar</command> und <command>man bzip2</command> f&uuml;r weitere Informationen und in der Bzip2 mini-HOWTO. Die bzip2 Homepage ist <ulink url="http://sources.redhat.com/bzip2/index.html">http://sources.redhat.com/bzip2 /index.html</ulink>.</para>
<!--add a link to Bzip2 mini-HOWTO-->
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Welche Dateien k&ouml;nnen Sie vom &kde;-Installationsverzeichnis l&ouml;schen? K&ouml;nnen Sie alle <filename>*.h</filename>, <filename>*.c</filename> und <filename>*.o</filename> l&ouml;schen?</para>
</question>
<answer>
<para>Es gibt keine Notwendigkeit, die <filename>.c</filename> und <filename>.o</filename>-Dateien zu behalten, aber die <filename>.h</filename>-Dateien werden gebraucht, wenn Sie jemals ein &kde;-Programm selbst kompilieren wollen. Wenn Sie allerdings Patches zum Quellprogramm hinzuf&uuml;gen wollen (anstatt alles neu herunterzuladen), dann sollten Sie alle diese Dateien behalten.</para> 
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Verlieren Sie Ihre aktuellen Einstellungen, wenn Sie &kde; upgraden?</para>
</question>
<answer>
<para>Es gibt widerspr&uuml;chliche Berichte &uuml;ber die Ergebnisse beim Upgraden von KDE 1.x nach KDE 2.0. Einstellungen sind im &kde; Unterverzeichnis in Ihrem Pers&ouml;nlichen Verzeichnis gespeichert. Es gibt allerdings jede Menge &Auml;nderungen - global und innerhalb der Anwendungen. F&uuml;r beste Ergebnisse sichern Sie Ihr altes &kde;-Unterverzeichnis, installieren Sie &kde; 2.0 und kopieren Sie dann alle wichtigen Mail- und News-Einstellungen zur&uuml;ck. Die meisten anderen Einstellungen sind so verschieden, dass es am besten ist, die Einstellungen direkt unter &kde; 2.0 vorzunehmen. Es gibt aber auch Berichte &uuml;ber Upgrades ohne jegliche Schwierigkeiten; so dass es nicht wirklich vorhersagbar ist, welche Ergebnisse Sie erhalten.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Kompilieren von kdebase gibt eine Fehlermeldung <errorname>bin/sh: msgfmt: command not found</errorname> zur&uuml;ck!</para>
</question>
<answer>
<para>Sie brauchen die <acronym>GNU</acronym> <application>msgfmt</application>, die Teil des <acronym>GNU</acronym> i18n Paketes <application>gettext</application> ist. Sie k&ouml;nnen dieses von jedem <acronym>GNU</acronym> Mirror herunterladen.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie k&ouml;nnen Sie &kde; Anwendungen deinstallieren, die von Grund auf neu kompiliert wurden?</para>
</question>
<answer>
<para>Diese Programme k&ouml;nnen Sie mit dem Befehl <command>make uninstall</command> deinstallieren. Dieser Befehl muss in dem selben Verzeichnis, in dem Sie den Befehl <command>make install</command> eingegeben haben, eingegeben werden. Wenn Sie dieses Verzeichnis schon gel&ouml;scht haben, gibt es nur einen - harten - Weg: Gehen Sie in das Verzeichnis <filename class="directory">$<envar>KDEDIR</envar>/bin</filename> und l&ouml;schen Sie die Dateien einzeln.</para>
</answer>
</qandaentry>

<qandaentry>
<question id="gif">
<para>Was ist Besonderes an der Unterst&uuml;tzung von &GIF;-Dateien?</para>
</question>
<answer>
<para>Dies hat mit Unisys' &LZW; Patent zu tun. &GIF;-Unterst&uuml;tzung ist in &Qt; 1.44 und dar&uuml;ber standardm&auml;&szlig;ig ausgeschaltet. Sie k&ouml;nnen entweder eine &auml;ltere &Qt; benutzen oder &Qt; mit dem Befehl <command>./configure <option>-gif</option></command> neukompilieren.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie installieren Sie &kde; themes?</para>
</question>
<answer>
<para>Es gibt noch keinen Manager f&uuml;r Designs (themes) in &kde; 2; unter <ulink url="http://kde.themes.org/php/comments.phtml?forum=news.26.34">http://kde.theme s.org/php/comments.phtml?forum=news.26.34</ulink> sollten Sie aber weitere Informationen finden.</para>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="panel">
<title>Die Kontrollleiste</title>

<qandaset>
<qandaentry>
<question>
<para>Wie f&uuml;gen Sie Anwendungen zur Kontrollleiste hinzu?</para>
</question>
<answer>
<para>Hierf&uuml;r gibt es mehrere Wege:</para>
<variablelist> <varlistentry><term>Benutzen Sie das Kontrollleistenmen&uuml;</term> <listitem> <para>Die wahrscheinlich einfachste Methode ist das Benutzen des Men&uuml;punktes <menuchoice><guimenu>Kontrollleiste</guimenu><guimenuitem>Hinzuf&uuml;gen </guimenuitem><guimenuitem>Anwendung</guimenuitem></menuchoice> im Kontrollleistenmen&uuml; (Das Men&uuml; das erscheint, wenn sie auf den <guibutton>K</guibutton>-Knopf klicken). Das Men&uuml; zeigt dann alle installierten &kde;-Anwendungen. Zum Hinzuf&uuml;gen klicken Sie einfach auf die Anwendung.</para> </listitem> </varlistentry> <varlistentry> <term>Benutzen Sie den Dateimanager</term> <listitem> <para>Sie k&ouml;nnen auch einfach eine <filename>.desktop</filename>Datei von einem Fenster des Dateimanagers auf die Kontrollleiste ziehen.</para> </listitem> </varlistentry> </variablelist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Warum zeigt die Uhr eine falsche Zeit an?</para>
</question>
<answer>
<para>In manchen &RedHat;-Systemen zeigt die Uhr in der Kontrollleiste die &GMT;-Zeit an. Dies ist ein Fehler im &RedHat;-Setup. Sie k&ouml;nnen dieses Problem l&ouml;sen, indem Sie mit dem folgenden Befehl einen symbolischen Link erzeugen: <command>ln -s /usr/share/zoneinfo /usr/lib/zoneinfo</command>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Ist es m&ouml;glich, &kpanel; in einem nicht-&kde;-basierten Fenstermanager zu betreiben?</para>
</question>
<answer>
<para>Ja. Versuchen Sie den Start mit dem folgenden Befehl: <command>kpanel <option>-no-KDE-compliant-window-manager</option></command>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Ist es m&ouml;glich, den <guibutton>K</guibutton>-Knopf in der Kontrollleiste zu &auml;ndern?</para>
</question>
<answer>
<variablelist> <varlistentry><term>&kde; 1.x</term> <listitem><para>Suchen Sie nach <filename>$<envar>HOME</envar>/.kde/share/apps/kpanel/pics/go.xpm</filename> und <filename>$<envar>HOME</envar>/.kde/share/apps/kpanel/pics/mini/go.xpm </filename> und ersetzen Sie diese. Vergessen Sie nicht die neuen Dateien auf eine Ebene zu reduzieren, sonst sehen Sie nichts. Erstellen Sie die Verzeichnisse wenn diese nicht existieren. Starten Sie &kpanel; neu.</para></listitem> </varlistentry> <varlistentry><term>&kde; 2</term> <listitem><para>Suchen Sie nach <filename>$<envar>HOME</envar>/.kde/share/apps/kicker/pics/go.png </filename> und <filename>$<envar>HOME</envar>/.kde/share/apps/kicker/pics/mini/go.png </filename> ersetzen Sie diese. Vergessen Sie nicht die neuen Dateien auf eine Ebene zu reduzieren, sonst sehen Sie nichts. Erstellen Sie die Verzeichnisse wenn diese nicht existieren. Starten Sie &kicker; neu.</para></listitem> </varlistentry> </variablelist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie starten Sie die Programmleiste au&szlig;erhalb der Kontrollleiste?</para>
</question>
<answer>
<para>Wenn Sie &kde; 2 final nutzen, k&ouml;nnen Sie dies nicht. Es wurde erst in den aktuellen <acronym>CVS</acronym>-Snapshot integriert. Weitere Informationen finden Sie unter: <ulink url="http://dot.kde.org/972916165">http://dot.kde.org/972916165</ulink>.</para>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="desktop">
<title>Die Arbeitsfl&auml;che</title>

<qandaset>
<qandaentry>
<question>
<para>Wie f&uuml;gen Sie eine Anwendung zur Arbeitsfl&auml;che hinzu?</para>
</question>
<answer>
<para>Das ist einfach: Klicken Sie mit der rechten Maustaste auf die Arbeitsfl&auml;che. Im Men&uuml; w&auml;hlen Sie <menuchoice><guimenu>Neu</guimenu><guimenuitem>Anwendung</guimenuitem> </menuchoice>. Geben Sie den Titel der Anwendung ein und diese wird auf der Arbeitsfl&auml;che erscheinen.</para>
<para>Wenn Sie die Eigenschaften des neuen Symbols &auml;ndern wollen , klicken Sie mit der rechten Maustaste auf dieses und w&auml;hlen Sie <guimenuitem>Eigenschaften</guimenuitem>. Im Dialog sollten Sie mindestens das auszuf&uuml;hrende Programm und das Symbol &auml;ndern. Das ist alles.</para> 
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie (un)mounten Sie ein Ger&auml;t (Dateisystem) von der Arbeitsfl&auml;che aus?</para>
</question>
<answer>
<para>Dies erfordert zwei Schritte:</para>
<procedure> <step performance="required"><para>Stellen Sie sicher, dass Ihnen das (un)mounten erlaubt ist. Normalerweise kann dies nur der Systemverwalter. Wenn Sie &kde; nicht als Systemverwalter betreiben (und das sollten Sie auch nicht), dann muss die Erlaubnis f&uuml;r das (Un)Mounten durch Nutzer in der Datei <filename>/etc/fstab</filename> eingetragen sein. Hier muss die Option <option>user</option> zu den Optionen des Dateisystems, das Sie (un)mounten wollen, hinzugef&uuml;gt werden.</para> <para>z.B. zum (un)Mounten des Diskettenlaufwerkes sollte Ihre Datei <filename>/etc/fstab</filename> folgende Zeile enthalten:</para> <screen>
/dev/fd0   /floppy   msdos   noauto,user,sync 0 0
</screen> </step> <step performance="required"> <para>Erstellen Sie eine <filename>.desktop</filename>-Datei f&uuml;r das Dateisystem. Ein Beispiel hierf&uuml;r ist:</para> <screen>
# KDE Config File
[KDE Desktop Entry]
UnmountIcon=3floppy_unmount.xpm
MountPoint=/floppy
Icon=3floppy_mount.xpm
Dev=/dev/fd0
ReadOnly=0
FSType=default
Type=FSDevice
Comment=Floppy Disc
</screen> </step> </procedure>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie nutzen Sie einen Bildschirmschoner als Hintergrund?</para>
</question>
<answer>
<para>Es ist m&ouml;glich, einen Bildschirmschoner anstelle eines Hintergrundbildes zu nutzen. Um dies zu tun, starten Sie irgendeinen Bildschirmschoner mit dem <option>-inroot</option> Parameter, z.B. <command>kswarm.kss <option>-inroot</option> &amp;</command>. Die meisten Bildschirmschoner sehen am besten aus, wenn Sie die Hintergrundfarbe schwarz einstellen. Bedenken Sie aber, dass die Verwendung eines Bildschirmschoners als Hintergrund CPU- und X-Zeit verbraucht....</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wo werden die Symbole gespeichert?</para>
</question>
<answer>
<para>Die Symbole werden nur in <filename class="directory">$<envar>KDEDIR</envar>/share/icons</filename> oder <filename class="directory">$<envar>HOME</envar>/.kde/share/icons</filename> gespeichert. Zum Benutzen von Symbolen, die an anderen Stellen gespeichert sind, m&uuml;ssen Sie diese entweder in eines der oben genannten Verzeichnisse kopieren oder symbolische Links erstellen.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie &auml;ndern Sie die Standardmen&uuml;eintr&auml;ge als Nicht-Systemverwalter?</para>
</question>
<answer>
<para>Versuchen Sie, die Zugriffsrechte und die Besitzverh&auml;ltnisse der Verzeichnisse und Dateien in <filename class="directory">$<envar>KDEDIR</envar>/share/applnk</filename> zu &auml;ndern. Als Alternative dazu k&ouml;nnen Sie eine vertrauensw&uuml;rdige Gruppe erzeugen (<abbrev>z.B.</abbrev>, Freunde) und den Befehl <command>chgrp <option>-R friends $<envar>KDEDIR</envar>/share/applnk</option>; chmod <option>-R g+w $<envar>KDEDIR</envar>/share/applnk</option></command> versuchen und alle vertrauensw&uuml;rdigen Nutzer zu Mitgliedern dieser Gruppe machen. Sie brauchen Systemverwalterrechte, um dieses zu tun. Wenn dies unm&ouml;glich ist, dann m&uuml;ssen Sie sich mit dem Editieren Ihres Pers&ouml;nlichen Men&uuml;s begn&uuml;gen.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie k&ouml;nnen Sie eine Maus mit Rollrad in &kde; nutzen?</para>
</question>
<answer>

<para>Unterst&uuml;tzung f&uuml;r M&auml;use mit Rollrad ist in &Qt; 2.0 und dar&uuml;ber enthalten, also wird &kde; die Nutzung des Rollrades automatisch unterst&uuml;tzen. Wenn Sie aber ein &auml;lteres &kde; benutzen, k&ouml;nnen Sie nur das Programm <application>IMWheel</application> versuchen, um das Rollrad mit Anwendungen wie &kfm;, &kedit;, und nicht-&kde;-Anwendungen wie &Emacs; benutzen zu k&ouml;nnen. Sie sollten dieses unter <ulink url="http://solaris1.mysolution.com/~jcatki/imwheel/"> http://solaris1.mysolution.com/~jcatki/imwheel/</ulink> finden. Die Informationen unter: <ulink url="http://www.inria.fr/koala/colas/mouse-wheel-scroll/"> http://www.inria.fr/koala/colas/mouse-wheel-scroll/</ulink> sollten Ihnen auch weiterhelfen.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Was genau ist das <filename class="directory">Templates</filename>-Verzeichnis?</para>
</question>
<answer>
<para>Das <filename class="directory">Templates</filename>-Verzeichnis enth&auml;lt Dinge, die Sie durch W&auml;hlen von <guisubmenu>Neu</guisubmenu> im Kontextmen&uuml; einfach erzeugen k&ouml;nnen. Sie k&ouml;nnen diese Vorlagen zum Erzeugen von Dingen auf der Arbeitsfl&auml;che und in einem Dateimanagerfenster verwenden. Klicken Sie einfach mit der rechten Maustaste auf den Platz, wo Sie das neue Element platzieren wollen.</para>
<para>Sie k&ouml;nnen Dateien und Verzeichnisse im <filename class="directory">Templates</filename> Verzeichnis speichern und diese werden im <guisubmenu>Neu</guisubmenu> Untermen&uuml; automatisch erscheinen. Wenn Sie diese im Untermen&uuml; ausw&auml;hlen, werden sie zur aktuellen Stelle kopiert.</para>
<para>Das Alles ist exakt dasselbe, wie &Ouml;ffnen des <filename class="directory">Templates</filename>-Verzeichnisses und Kopieren von Dingen von dort, nur etwas einfacher. Standardm&auml;&szlig;ig ist das <filename class="directory">Templates</filename>-Verzeichnis nur mit <filename>.desktop</filename>-Dateien gef&uuml;llt. Diese Dateien sind dort, um Ihnen das sofortige Erzeugen von Ger&auml;ten, Programmen, &URL;-Links und neuen &MIME;-Typen zu erm&ouml;glichen, aber Sie k&ouml;nnen alles, was Sie wollen, darin speichern.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Warum k&ouml;nnen Sie die Systemkl&auml;nge nicht einschalten, z.B. zum &Ouml;ffnen von Fenstern?</para>
</question>
<answer>
<para>Systemkl&auml;nge funktionieren derzeit nicht in nicht-FreeBSD und nicht-&Linux; Systemen. An der Beseitigung dieses Problems wird gearbeitet. Wenn Sie FreeBSD oder &Linux; benutzen und Sie k&ouml;nnen die Systemkl&auml;nge nicht einschalten, dann haben Sie einen Fehler gefunden; bitte senden Sie einen Problembericht.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie starten Sie Anwendungen auf einer bestimmten Arbeitsfl&auml;che?</para>
</question>
<answer>
<variablelist> <varlistentry><term>&kde; pre-1.1 und dar&uuml;ber</term> <listitem> <para>&kde; pre-1.1 und dar&uuml;ber kommen mit einem Programm &kstart;. Sie k&ouml;nnen dieses in einer <filename>.kdelnk</filename>-Datei (<filename>.desktop</filename> f&uuml;r &kde; 2) wie dieser verwenden:</para> <screen>
Name=Netscape
Exec=kstart "netscape" -window ".*Netscape.*" -desktop 2 -maximize
BinaryPattern=netscape;
Icon=netscape.xpm
Path=
Type=Application
Terminal=0
</screen> <para>Sie k&ouml;nnen auch einfach den folgenden Befehl ausf&uuml;hren: <command>kstart <option>"netscape" -desktop 2 -activate</option></command>.</para> </listitem> </varlistentry> <varlistentry><term>&kde; 1.0 und darunter</term> <listitem> <para>Benutzen Sie ein Shellskript. Das folgende Skript sollte diese Aufgabe erf&uuml;llen:</para> <screen>
kwmcom desktop2 <lineannotation>(or desktop3, desktop4, whatever)</lineannotation> netscape
</screen> <para>Dieses Beispielskript hat den unerw&uuml;nschten Effekt, Sie auf der Arbeitsfl&auml;che 2 zu lassen, wenn es fertig ist.</para> <note> <para>Wenn Sie bisher noch nicht mit Shellskripts gearbeitet haben, das ist ganz einfach, diese sind ganz normale Textdateien, die mit dem Befehl <command>chmod <option>+x</option></command> ausf&uuml;hrbar gemacht werden. Sie sind die &Linux;-Version der <acronym>DOS</acronym> *.bat-Dateien aber nat&uuml;rlich besser.</para> </note> </listitem> </varlistentry> </variablelist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie stellen Sie gr&ouml;&szlig;ere Schrift ein, wenn nach dem Einstellen im &kde;-Kontrollzentrum die Schriften immer noch zu klein sind?</para>
</question>
<answer>
<para>Viele Benutzer verwenden die 75<acronym>dpi</acronym>-Fonts als Standard. Wenn Sie die 100<acronym>dpi</acronym>-Fonts installiert haben, stellen Sie sicher, dass diese im Pfad in der <filename>XF86Config</filename>-Datei vor den 75 <acronym>dpi</acronym> Fonts erscheinen. Hier ist eine Schritt-f&uuml;r-Schrittanleitung dazu:</para>
<procedure> <step performance="required"><para>&Ouml;ffnen Sie <filename>/etc/Xll/XF86Config</filename> in Ihrem bevorzugten Editor.</para></step> <step performance="required"><para>Ziemlich weit oben in der Datei finden Sie einige Zeilen mit einer Liste von Fonts: type1, speedo, <abbrev>etc.</abbrev>, und am unteren Ende dieser Liste stehen zwei Eintr&auml;ge: 75dpi und 100dpi. Vertauschen Sie deren Reihenfolge; und weil Sie gerade dabei sind: Verschieben Sie die Type 1 Fonts an das Ende der Liste (oder irgendwo unterhalb der 75 und 100 <acronym>dpi</acronym> Fonts). Das verbessert die Anzeige von Schriften nochmals.</para></step> </procedure>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Ist es m&ouml;glich, die Arbeitsfl&auml;chenmen&uuml;s zu erweitern?</para>
</question>
<answer>
<para>Ja. F&uuml;gen Sie einfach die .applnk-Datei f&uuml;r den gew&uuml;nschten Befehl zum Verzeichnis <filename class="directory">$<envar>KDEDIR</envar>/share/applnk</filename> hinzu oder nutzen Sie &kmenuedit;.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>K&ouml;nnen Sie die <guiicon>M&uuml;lleimer</guiicon>/<guiicon>Vorlagen</guiicon>/<guiicon> Autostart</guiicon> Symbole l&ouml;schen?</para>
</question>
<answer>
<variablelist> <varlistentry><term>&kde; 1.x</term> <listitem><para>Ja. Editieren Sie einfach <filename>$<envar>KDEDIR</envar>/bin/startkde</filename> und ersetzen Sie den Befehl <command>kfm</command> mit <command>kfm -w</command>. Wenn das nicht hilft, dann gibt es einen zweiten Weg. F&uuml;gen Sie die folgenden Zeilen zur Datei <filename>$<envar>HOME</envar>/.kde/share/config/kfmrc</filename> hinzu:</para> <screen>
[Paths]
Trash=/home/me/Trash/
Desktop=/home/me/Desktop
Templates=/home/me/Templates/
Autostart=/home/me/Autostart/
</screen> <para>The effect is to take Trash, Templates, and Autostart and put them into your home directory instead of your <filename class="directory">$<envar>HOME</envar>/Desktop</filename> directory. You will have to restart &kde;, and you may have to delete the icons from the desktop the first time. Please make sure you move anything you have in Autostart into <filename>$<envar>HOME</envar>/Autostart</filename> before deleting it from the desktop. And then you will have a nice, clean desktop with no "My Computer" sort of look.</para></listitem> </varlistentry> <varlistentry><term>&kde; 2</term> <listitem><para>Ja. &Ouml;ffnen Sie das &kde;-Kontrollzentrum und w&auml;hlen Sie <guisubmenu>Arbeitsfl&auml;che</guisubmenu> (unter <guimenu>Erscheinungsbild</guimenu>, dann <guimenuitem>Allgemein</guimenuitem>. Hier k&ouml;nnen Sie neue Pfadangaben f&uuml;r die Verzeichnisse eingeben und &kde; verschiebt diese automatisch an den neuen Speicherort.</para></listitem> </varlistentry> </variablelist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wo m&uuml;ssen Sie Dateien speichern, wenn Sie wollen, dass diese auf der Arbeitsfl&auml;che erscheinen?</para>
</question>
<answer>
<para><filename class="directory">$<envar>HOME</envar>/Desktop</filename>. Sie m&uuml;ssen m&ouml;glicherweise Ihre Arbeitsfl&auml;che neu einlesen, nachdem Sie Ihre Dateien gesichert haben, um diese auf der Arbeitsfl&auml;che erscheinen zu lassen. Beim n&auml;chsten Anmelden geschieht dies automatisch.</para>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="windowmanager">
<title>Der Fenstermanager</title>

<para>Der Standardfenstermanager der von &kde; bereitgestellt wird, ist der K Window Manager (&kwm; in &kde; 1.x und &kwin; in &kde; 2). Bitte lesen Sie im "The K Window Manager Handbook" (sollten Sie im <application>&kde; Help Center</application> finden <application>&kde;-Hilfezentrum</application>) f&uuml;r weitere Informationen nach.</para>

<qandaset>
<qandaentry>
<question>
<para>Gibt es Tastaturkurzbefehle f&uuml;r die &kwm;- (&kwin;)-Bedienung?</para>
</question>
<answer>
<para>Ja. Bitte lesen Sie im "The K Window Manager Handbook" nach, welche Tastaturkurzbefehle es gibt.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>K&ouml;nnen Sie einen eigenen Satz Tastaturkurzbefehle erstellen?</para>
</question>
<answer>
<para>Ja, wenn Sie &kde; 1.x benutzen. Starten Sie <application>&kde;-Kontrollzentrum</application> und w&auml;hlen Sie <menuchoice><guimenu>Erscheinungsbild</guimenu> <guimenuitem>Tastenzuordnung</guimenuitem></menuchoice> um Tastaturkurzbefehle f&uuml;r den Fenstermanager wie Maximieren von Fenstern, <abbrev>etc.</abbrev> einzustellen. Um Anwendungen mit Tastaturkurzbefehlen starten zu k&ouml;nnen, m&uuml;ssen Sie m&ouml;glicherweise <application>KHotKeys</application> installieren.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wenn Sie ein Fenster "minimieren" und es verschwindet, wohin verschwindet es?</para>
</question>
<answer>
<para>In vielen &X;-&GUI;'s wird die Funktion Minimieren durch L&ouml;schen des Fensters, in dem das Programm l&auml;uft und Erstellen eines Icons an dessen Stelle realisiert. Nicht so bei &kde;. Hier wird das Fenster einfach versteckt und das Programm l&auml;uft noch.</para>
<para>Es gibt mehrere Wege, um auf ein verstecktes Fenster zuzugreifen:</para>
<itemizedlist> <listitem> <para>Wenn Sie die Programmleiste von &kpanel; (oder &kicker;) benutzen, k&ouml;nnen Sie einstellen, dass eine Liste der laufenden Programme auf Ihrer Arbeitsfl&auml;che angezeigt wird. Die Namen von versteckten Programmen werden in Klammern angezeigt.</para> </listitem> <listitem> <para>Klicken mit der mittleren Maustaste auf den Hintergrund der Arbeitsfl&auml;che erzeugt eine Liste der laufenden Programme und auch hier werden die Namen der versteckten Programme in Klammern angezeigt.</para> </listitem> </itemizedlist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie erzeugen Sie ein angeheftetes Fenster ohne R&auml;nder und Focus?</para>
</question>
<answer>
<para>Wenn Sie &kde; 1.1 und dar&uuml;ber nutzen, k&ouml;nnen Sie &kstart; benutzen. Angenommen, Sie wollen die Anwendung <application>xosview</application> starten, geben Sie einfach den Befehl <command>kstart xosview <option>-window xosview -sticky -decoration none</option></command> ein. Der Befehl <command>kstart <option>--help</option></command> gibt zus&auml;tzliche Informationen aus. Dar&uuml;berhinaus k&ouml;nnen Sie diese Einstellungen in <application>&kde;-Kontrollzentrum</application> unter <guimenu>Fenster</guimenu> vornehmen.</para>
<para>In &kde; 1.0 m&uuml;ssen Sie die folgenden Zeilen in die Konfigurationsdatei <filename>kwmrc</filename> schreiben:</para>
<programlisting>
[Sticky]
stickyClasses=xosview,
[Focus]
noFocusClasses=xosview,
[Decoration]
noDecorationClasses=xosview,
</programlisting>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie beenden Sie &kwmpager;?</para>
</question>
<answer>
<para>Klicken mit der rechten Maustaste auf den Rand des Rahmens &ouml;ffnet ein Men&uuml; in dem Sie Schlie&szlig;en f&uuml;r den &kwmpager; w&auml;hlen k&ouml;nnen. &kwmpager; ist &uuml;brigens veraltet und wurde ersetzt durch <application>kpager</application>.</para>
<para>Wenn Sie lieber in einer Kommandozeile arbeiten, dann geben Sie den Befehl <command>ps ax | grep kwmpager</command> ein, um die Prozessnummer f&uuml;r kwmpager herauszufinden und dann beenden Sie diesen mit dem Befehl <command>kill <replaceable>pid</replaceable></command>. Eine andere M&ouml;glichkeit ist die Tastenkombination <keycombo action="simul">&Strg;&Alt;&Esc;</keycombo> die die KDE-System&uuml;berwachung &ouml;ffnet, dann markieren Sie &kwmpager; und klicken Sie um diesen zu beenden. Zum Abbrechen (nicht R&uuml;ckg&auml;ngigmachen) des Beendens, Dr&uuml;cken Sie einfach noch einmal <keycombo action="simul">&Strg;&Alt;&Esc;</keycombo>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie k&ouml;nnen Sie Fenster ausschlie&szlig;lich horizontal oder vertikal maximieren?</para>
</question>
<answer>
<para>Vorausgesetzt Ihr Fenster ist nicht schon maximiert, Klicken auf den Knopf Maximieren mit der linken Maustaste/mittleren Maustaste/rechten Maustaste maximiert das Fenster voll/vertikal/horizontal.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Was ist die "Fensterheber"-Funktion?</para>
</question>
<answer>
<para>Die "Fensterheber"-Funktion erm&ouml;glicht Aufrollen des Fensters, so dass nur die Titelleiste sichtbar bleibt. Dies k&ouml;nnen Sie durch Doppelklicken auf die Titelleiste ein- und ausschalten.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Ist es m&ouml;glich, schattierte Rahmen wie in FVWM2 f&uuml;r die Platzierung von Fenstern einzustellen?</para>
</question>
<answer>
<para>Ja. Starten Sie <application>&kde;-Kontrollzentrum</application> und w&auml;hlen Sie <guimenu>Erscheinungsbild</guimenu> -> <guisubmenu>Fenster-Eigenschaften</guisubmenu> und letztendlich <guimenuitem>Aktionen</guimenuitem>. Dort finden Sie eine Einstellungsm&ouml;glichkeit f&uuml;r die Platzierung.</para>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="filemanager">
<title>Der Dateimanager</title>

<para>Der Standarddateimanager f&uuml;r &kde; 1.x ist &kfm;, f&uuml;r &kde; 2 ist es &konqueror;. Die &konqueror;-Homepage finden Sie unter: <ulink url="http://www.konqueror.org">http://www.konqueror.org</ulink>. Dort gibt es auch eine <acronym>FAQ</acronym> zu &konqueror;.</para>

<qandaset>
<qandaentry>
<question>
<para>Wie nutzen Sie &kfm; oder &konqueror; als Web-Browser mit Proxy?</para>
</question>
<answer>
<para>Beide, &kfm; und &konqueror;, k&ouml;nnen &uuml;ber &HTTP;- und &FTP;-Proxies benutzt werden. Sie k&ouml;nnen den Proxyserver in &kfm; durch <guimenu>Einstellungen</guimenu>-><guimenuitem>Configure Browser</guimenuitem>-> <guilabel>Proxy</guilabel> im &kfm;-Men&uuml; einstellen. Stellen Sie sicher, dass Sie die &Auml;nderungen mit <guimenu>Einstellungen</guimenu>-> <guimenuitem>Einstellungen speichern</guimenuitem> sichern, damit diese dauerhaft sind.</para>
<para>F&uuml;r &konqueror; w&auml;hlen Sie <menuchoice><guimenu>Einstellungen</guimenu> <guisubmenu>Einrichten</guisubmenu> <guimenuitem>Proxies...</guimenuitem></menuchoice> im &konqueror; Men&uuml;. Stellen Sie sicher, dass Sie die &Auml;nderungen mit <guimenu>Einstellungen</guimenu>-><guimenuitem>Optionen speichern</guimenuitem> sichern, damit diese dauerhaft sind.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie k&ouml;nnen Sie das Erscheinungsbild eines Verzeichnisses in &kfm; und &konqueror; einstellen?</para>
</question>
<answer>
<para>Wenn in &kfm; oder &konqueror; ein Verzeichnis angezeigt wird, halten Sie Ausschau nach einer versteckten Datei mit Namen <filename>.directory</filename> in diesem Verzeichnis. Sie k&ouml;nnen diese Datei auch selbst erstellen, um die Anzeige des Verzeichnisses zu ver&auml;ndern. Die Datei ist einfach eine kdelnk- (oder <filename>desktop</filename>- f&uuml;r &kde; 2) Datei. Zum Beispiel:</para>
<screen>
# KDE Config File
[KDE Desktop Entry]
Name=Settings
Name[de]=Einstellungen
Name[pl]=Ustawienia
MiniIcon=kcontrol.xpm
SortOrder=Desktop,Input_Devices,KWM,Network,Information,Sound
Icon=kcontrol.xpm
</screen>
<para>Diese Datei wird zur Beschreibung des Verzeichnisses Einstellungen benutzt. Sie ver&auml;ndert das Icon, das zur Anzeige des Verzeichnisses benutzt wird, setzt den (in Abh&auml;ngigkeit von der Sprache) angezeigten Namen des Verzeichnisses und legt die Reihenfolge, in der die Unterverzeichnisse angezeigt werden, fest.</para>
<para>F&uuml;r die Verzeichnisse, die das <guimenu>K</guimenu>-Men&uuml; bilden, k&ouml;nnen Sie auch &kmenuedit; zum &Auml;ndern des Erscheinungsbildes benutzen.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie k&ouml;nnen Sie non-anonymous &FTP;-Transfers mit &kfm; und &konqueror; durchf&uuml;hren?</para>
</question>
<answer>
<para>Normalerweise, wenn Sie eine &URL; wie <userinput>ftp://<replaceable>ftp.somehost.com</replaceable></userinput> eingeben, versuchen &kfm; und &konqueror; ein anonymes Login in den &FTP;-Server. Wenn Sie sich als ein spezieller Nutzer anmelden wollen, geben Sie die &URL; als <userinput>ftp://<replaceable>username@ftp.somehost.com</replaceable> </userinput> ein. &kfm; und &konqueror; fragen nach einem Passwort und verbinden Sie dann mit dem Server.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Was ruft die Fehlermeldung <errorname>KFM kann nicht zum "localhost" verbinden</errorname> hervor?</para>
</question>
<answer>
<para>In den meisten F&auml;llen wird dies durch eine nicht richtig eingerichtete Loopbackroute in Ihrem System.</para>
<variablelist> <varlistentry><term>Wo suchen Sie Probleme?</term> <listitem> <para>Pr&uuml;fen Sie, ob <command>ping localhost</command> die folgende Ausgabe zur&uuml;ckgibt:</para> <screen><computeroutput>
PING localhost (127.0.0.1): 56 data bytes
64 bytes from 127.0.0.1: icmp_seq=0 ttl=64 time=0.3 ms
64 bytes from 127.0.0.1: icmp_seq=1 ttl=64 time=0.2 ms
64 bytes from 127.0.0.1: icmp_seq=2 ttl=64 time=0.2 ms 
...
</computeroutput></screen> <para>Wenn nicht, dann ist Ihr Loopbackinterface oder dessen Route nicht richtig konfiguriert.</para> <para>Die Ausgabe des Befehls <command>/sbin/route</command> sollte folgende Zeilen enthalten:</para> <screen><computeroutput>
Destination     Gateway         Genmask         Flags MSS    Window Use Ifac
loopback        *               255.0.0.0       U     3584   0       13 lo
</computeroutput></screen> <para>Die wichtigen Felder sind Destination, Gateway, Genmask, und Iface. Die o.a. Zeile sagt, dass das System richtig konfiguriert ist, um allen Loopback-Verkehr durch das Loopbackinterface (lo) zu leiten.</para> <para>Die Ausgabe des Befehls <command>/sbin/ifconfig</command> sollte die folgenden Zeilen enthalten:</para> <screen><computeroutput>
lo        Link encap:Local Loopback
          inet addr:127.0.0.1  Bcast:127.255.255.255  Mask:255.0.0.0
          UP BROADCAST LOOPBACK RUNNING  MTU:3584  Metric:1
</computeroutput></screen> <para>Dies sagt, dass das Loopbackinterface arbeitet.</para> <para>Die Datei <filename>/etc/hosts</filename> in Ihrem System sollte die folgende Zeile enthalten:</para> <screen>
127.0.0.1       localhost
</screen> <para>Dies stellt sicher, dass der Hostname "localhost" mit der Loopbackadresse (127.0.0.1) verbunden ist.</para> </listitem> </varlistentry> <varlistentry><term>Beheben dieser Probleme</term> <listitem> <para>Geben Sie die Befehle <command>/sbin/ifconfig <option>lo 127.0.0.1</option></command> und <command>/sbin/route <option>add -net 127.0.0.0</option></command> ein. Beide Befehle sollten in einem richtig eingerichteten System beim Systemstart ausgef&uuml;hrt werden. Wenn das nicht geschieht, dann sehen Sie in den Netz-Startup-Dateien im Verzeichnis <filename class="directory">/etc/rc.d</filename> nach.</para> </listitem> </varlistentry> <varlistentry><term>Wenn es dann <emphasis>immer noch nicht</emphasis> funktioniert</term> <listitem> <para>Wenn nichts von dem hilft, bitte schicken Sie einen vollen Bericht an das <ulink url="http://bugs.kde.org">&kde; Bug Tracking System</ulink>. Vergessen Sie nicht, anzugeben, dass Sie alle diese Dinge &uuml;berpr&uuml;ft haben.</para></listitem> </varlistentry> </variablelist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Was sind <option>%i</option> und <option>%m</option> in der Zeile Ausf&uuml;hren?</para>
</question>
<answer>
<para>Diese werden von allen &kde;-Anwendungen benutzt (sie sind implementiert in <classname>KApplication</classname> und alle guten &kde;-Programme erzeugen ein <classname>KApplication</classname>-Objekt, noch bevor sie die Befehlszeilenargumente auswerten).</para>
<para>Eine Standardzeile f&uuml;r eine &kde;-Anwendung sieht so aus: <command>foo <option>... %i %m -caption \"%c\"</option></command>. Das ist ziemlich un&uuml;bersichtlich, aber es musste so gemacht werden, um die Integration von &auml;lteren, nicht-&kde;-Anwendungen so einfach wie m&ouml;glich zu machen. &kfm; und &konqueror; erweitern diese Zeile zu <command>foo <option>-icon something.xpm -miniicon something_mini.xpm -caption \"The Foo\"</option></command>. Beide, das Icon und das Mini-Icon wie auch "The Foo" sind Eigenschaften, die in der .<filename>desktop</filename>-Datei festgelegt sind. Wenn die Icons nicht definiert sind, dann werden einfach die der ausf&uuml;hrbaren Datei "foo" benutzt.</para>
<para>Auf diese Weise kann der Benutzer mit &kmenuedit; diese Einstellungen ver&auml;ndern. <option>-caption</option> ist wichtig, denn niemand m&ouml;chte, dass <guilabel>Editor</guilabel> etwas mit Namen <guilabel>kedit-0.9pl4-build47</guilabel> startet. Statt dessen erwartet man ein Fenster mit Namen <guilabel>Editor</guilabel>. Weiterhin k&ouml;nnen diese Namen auf die Sprache des Benutzers angepasst werden, <abbrev>i.e.</abbrev> ein amerikanischer Nutzer startet <guimenuitem>CD-Player</guimenuitem> und bekommt ein Fenster mit Namen <guilabel>CD-Player</guilabel> w&auml;hrend ein deutscher Nutzer <guimenuitem>CD Spieler</guimenuitem> startet und ein Fenster mit Namen <guilabel>CD-Spieler</guilabel> erh&auml;lt.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie geben Sie das Startverzeichnis f&uuml;r &kfm; und &konqueror; an?</para>
</question>
<answer>
<para>Klicken Sie rechts auf den &kfm;- (oder &konqueror;-) Icon und w&auml;hlen Sie <guimenuitem>Eigenschaften</guimenuitem>. Unter dem <guilabel>Ausf&uuml;hren</guilabel>-Tab finden Sie etwas wie <command>kfmclient Verzeichnis %u file:/root</command>; &auml;ndern Sie einfach <filename class="directory">/root</filename> in das gew&uuml;nschte Verzeichnis, in dem &kfm; (oder &konqueror;) starten soll.</para>
</answer>
</qandaentry>

<qandaentry>
<question id="nsbookmark">
<para>Wie importieren Sie &Netscape; Lesezeichen?</para>
</question>
<answer>
<para>Schauen Sie in die volle Liste der &kde;-Anwendungen (nicht nur die in der Distribution) unter <ulink url="http://www.kde.org/applications.html">http://www.kde.org/applications.html</ulink>. In der Sektion Network finden Sie <application>knsbookmark</application>; dies ist das Werkzeug das Sie brauchen.</para>
<para>Wenn Sie &kde; 2 benutzen, dann brauchen Sie nichts zu importieren. &Netscape;s Lesezeichen sind automatisch verf&uuml;gbar im Men&uuml; <guimenu>Lesezeichen</guimenu> in &konqueror;, ohne die Notwendigkeit irgendeines Einrichtens oder des Importierens.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Gibt es eine "Sichern als"-Funktion in &kfm; und &konqueror;?</para>
</question>
<answer>
<para>Es gibt etwas &Auml;hnliches: <guimenu>Anzeigen</guimenu>-><guimenuitem>Quelle anzeigen</guimenuitem> &ouml;ffnet Ihren bevorzugten Editor mit dem Quellcode, den Sie dann sichern k&ouml;nnen. Das funktioniert f&uuml;r text/html-Dateien, aber nicht f&uuml;r Grafikdateien. F&uuml;r diese klicken Sie mit der rechten Maustaste auf das Bild und w&auml;hlen Sie <guimenu>&Ouml;ffnen</guimenu> in einem Grafikeditor, um die Datei zu &ouml;ffnen und dann von dort aus zu speichern.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie betr&uuml;gen Sie eine Webseite, so dass diese glaubt &konqueror; ist &Netscape; oder irgendein anderer Browser?</para>
</question>
<answer>
<para>Starten Sie <application>&kde;-Kontrollzentrum</application> -><menuchoice><guimenu>Web-Browser</guimenu><guimenuitem> User Agent</guimenuitem></menuchoice>. F&uuml;gen Sie den gew&uuml;nschten User Agent hinzu.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie konfigurieren Sie &konqueror; f&uuml;r das Anzeigen von &Java; Applets?</para>
</question>
<answer>
<para>W&auml;hlen Sie <menuchoice><guimenu>Einstellungen</guimenu> <guisubmenu>Einrichten</guisubmenu> <guimenuitem>Browser...</guimenuitem></menuchoice> im &konqueror;-Men&uuml;. Beachten Sie, dass Sie eine Webseite anzeigen m&uuml;ssen, damit das <guimenu>Settings</guimenu>-Men&uuml; nicht "ausgegraut" ist.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Warum kann &konqueror; keine &GIF;-Bilddateien anzeigen?</para>
</question>
<answer>
<para>Das passiert, weil Sie die &GIF;-Unterst&uuml;tzung in &Qt; nicht erlaubt haben. Weitere Informationen hierzu finden Sie unter: <xref linkend="gif"/>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie k&ouml;nnen Sie Dateien umbenennen?</para>
</question>
<answer>
<para>Klicken Sie mit der rechten Maustaste auf die Datei und w&auml;hlen Sie <guimenuitem>Eigenschaften</guimenuitem>. Dort k&ouml;nnen Sie die Datei umbenennen.</para>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="configure">
<title>Einrichten von &kde;</title>

<qandaset>
<qandaentry>
<question>
<para>Wie stellen Sie die Sprache, die von &kde; benutzt wird, ein?</para>
</question>
<answer>
<para>Es gibt zwei Wege, um die Sprache f&uuml;r die &kde;-Ausgaben einzustellen:</para>
<variablelist> <varlistentry><term>Benutzen Sie das &kde;-Kontrollzentrum</term> <listitem><para>Starten Sie &kde;-Kontrollzentrum und w&auml;hlen Sie <guimenu>Pers&ouml;nliche Einstellungen</guimenu>-><guimenuitem>Land &amp; Sprache</guimenuitem>. Hier k&ouml;nnen Sie Sprache und Land einstellen. Wenn &kde; keine &Uuml;bersetzung in der gew&auml;hlten Sprache findet, wird die Standardsprache eingestellt. Normalerweise ist das (amerikanisches) Englisch.</para> <note><para>Benutzen des &kde;-Kontrollzentrums ist der beste Weg, um die Sprache in &kde; einzustellen.</para></note></listitem> </varlistentry> <varlistentry><term>Benutzen der <envar>LANG</envar> Umgebungsvariable</term> <listitem><para>Die zweite Methode nutzt die Standardeinstellungen in Ihrem System. Um die Sprache zu &auml;ndern setzen Sie einfach die Umgebungsvariable entsprechend. z.B., wenn Ihre Shell <application>bash</application> ist, f&uuml;hren Sie den Befehl <command>export LANG=de</command> aus, um Deutsch als Sprache einzustellen.</para></listitem> </varlistentry> </variablelist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Gibt es eine Umschaltung f&uuml;r Tastaturen verschiedener L&auml;nder in &kde;?</para>
</question>
<answer>
<para>In &kde; 1.1 (und dar&uuml;ber) gab es &kikbd; das diese Einstellungen erlaubt, aber &kikbd; ist komplett entfernt worden. Benutzen Sie an dessen Stelle <application>xkb</application>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie k&ouml;nnen Sie den Standard &Linux; Text Login Bildschirm mit dem &kde; Login Bildschirm ersetzen?</para>
</question>
<answer>
<para>Erstens, Sie m&uuml;ssen in den "xdm runlevel" (Runlevel 5 in &RedHat; Systemen, 3 in S.u.S.E.) wechseln, dies erreichen Sie durch Editieren der Datei <filename>/etc/inittab</filename>. In dieser Datei finden Sie die folgende Zeile <userinput>id:3:initdefault:</userinput>. &Auml;ndern Sie dies in <userinput>id:5:initdefault:</userinput>. Am Ende der Datei, versehen Sie die folgende Zeile mit einem Kommentarzeichen, um sie unwirksam zu machen: <userinput>x:5:respawn:/usr/bin/X11/xdm -nodaemon</userinput> und ersetzen Sie diese durch: <userinput>x:5:respawn:<replaceable>/opt/kde/</replaceable>bin/kdm -nodaemon</userinput>. <note><para>The location of &kdm; may differ on your system.</para></note></para>
<para>For changes to take effect immediately, type <command>init 5</command> (for &RedHat; systems) at the shell prompt. <caution><para>Das Aktivieren des Grafischen Anmeldens ohne vorherigen Test der Funktionsf&auml;higkeit birgt ein Risiko. Wenn es nicht richtig funktioniert, ist es schwierig, zu einer Befehlszeile zur&uuml;ck zu kommen.... Aktivieren Sie dieses also erst, wenn die grafische Benutzeroberfl&auml;che grunds&auml;tzlich funktioniert.</para></caution></para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie ersetzen Sie &kwm; oder &kwin; mit einem anderen &kde;-kompatiblen Fenstermanager wie <application>Blackbox</application> oder &windowmaker;?</para>
</question>
<answer>
<para>Erstens, besorgen Sie sich die Quellen und kompilieren Sie diese. Wahrscheinlich m&uuml;ssen Sie beim Ausf&uuml;hren des Skriptes <filename>configure</filename> Optionen angeben, um &kde;-kompatible Bin&auml;rdateien zu erzeugen. Lesen Sie in <filename>README</filename> und <filename>INSTALL</filename> nach, dort erhalten Sie detaillierte Anleitung. Dann ersetzen Sie einfach den Befehl <command>kwm</command> im <filename>startkde</filename>-Skript mit dem Befehl, der den neuen Fenstermanager startet und Sie sind fertig. F&uuml;r &kde; 2 m&uuml;ssen Sie den Befehl <application>ksmserver</application> in <filename>startkde</filename> umschreiben, damit dieser mit der Option <option>--windowmanager <replaceable>my_window_manager</replaceable></option> ausgef&uuml;hrt wird.</para>
<para><application>Blackbox</application> ist ein weiterer Fenstermanager f&uuml;r &X;. Dieser ist mit C++ erzeugt und hat keinen gemeinsamen Code mit irgendeinem anderen Fenstermanager (auch wenn die grafische Ausf&uuml;hrung &auml;hnlich zu der von &windowmaker; ist). <application>Blackbox</application> ist &kde;-kompatibel seit der Release 0.50.2. Weitere Informationen hierzu finden Sie unter <ulink url="http://blackbox.alug.org/">Blackbox @ alug.org</ulink> und <ulink url="http://www.draknor.net/kbb/">KBB - getting <application>Blackbox</application> to work with &kde;</ulink> useful.</para>
<para>Um <application>Blackbox</application> mit &kde; zu nutzen, besorgen Sie sich den Quellcode in der .tar, unpacken Sie diese, wechseln Sie in das neu erzeugte Verzeichnis und f&uuml;hren Sie den Befehl <command>./configure <option>--with-kde</option> ; make ; su -c 'make install'</command> (die Option <option>--with-kde</option> schaltet die &kde;-Unterst&uuml;tzung ein).</para>
<para>Als n&auml;chstes editieren Sie das <filename>startkde</filename>-Skript wie oben erl&auml;utert, so dass dieses <command>blackbox</command> startet. Speichern Sie das bearbeitete Skript als z.B. <filename>$<envar>KDEDIR</envar>/bin/startbb</filename> und &auml;ndern Sie die letzte Zeile Ihrer X-Startdatei so dass diese das neue Skript startet. Starten Sie dann &X; und Sie sind fertig.</para>
<para>&windowmaker; ist ein X11 Fenstermanager, der entwickelt wurde, um zus&auml;tzliche Unterst&uuml;tzung f&uuml;r f&uuml;r <ulink url="http://www.gnustep.org/">GNUstep</ulink>-Anwendungen zu geben. Er versucht, das elegante Aussehen der &NeXTSTEP; &GUI; zu emulieren, ist vergleichsweise schnell, hat viele eingebaute Features und ist einfach einzurichten und zu nutzen. &windowmaker; ist seit der Release 0.50.0 &kde;-kompatibel. Auf der <ulink url="http://www.windowmaker.org/">Official Window Maker Website</ulink> finden Sie weitere Informationen</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie &auml;ndern Sie das &RedHat; &Linux; Logo auf der Startseite?</para>
</question>
<answer>
<para>&RedHat; nutzt <application>xbanner</application> zum Anzeigen des Logos, zum Ausschalten kommentieren Sie einfach die Zeile, die <application>xbanner</application> aufruft, in der Konfigurationsdatei die <application>xdm</application> liest, aus. Diese Datei ist <filename>/etc/X11/xdm/Xsetup_0</filename> (Dies kann in verschiedenen Systemen unterschiedlich sein). Wenn Sie irgendetwas anderes anstelle von <application>xbanner</application> anzeigen wollen, dann schreiben Sie dies einfach hier hinein, z.B. <command><replaceable>/opt/kde</replaceable>/bin/kdmdesktop</command>. </para>
</answer>
</qandaentry>

<qandaentry>
<question>

<para>Sie m&ouml;chten mit der linken Maustaste irgendwo auf die Arbeitsfl&auml;che klicken und das <guimenu>K</guimenu>-Men&uuml; angezeigt bekommen.</para>
</question>
<answer>
<variablelist> <varlistentry><term>&kde; 1.x</term> <listitem><para>First, edit <filename>$<envar>HOME</envar>/.kde/share/config/krootwmrc</filename> and add the following two lines:</para> <screen>
[MouseButtons]
Left=Menu
</screen> <para>Starten Sie &kde; neu.</para></listitem> </varlistentry> <varlistentry><term>&kde; 2</term> <listitem><para>Open the <application>&kde; Control Center</application> and choose <menuchoice><guisubmenu>Look and Feel</guisubmenu><guisubmenu>Desktop</guisubmenu> <guisubmenu>General</guisubmenu></menuchoice>. You can now choose the behavior of mouse clicks on the desktop. To have the <guimenu>K</guimenu> menu open from a single &LMB; click, change the entry labeled <guilabel>Left button</guilabel> to say <guilabel>Application Menu</guilabel>.</para></listitem> </varlistentry> </variablelist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie nutzen Sie die drei zus&auml;tzlichen Tasten auf der &Windows;-Tastatur in &kde;?</para>
</question>
<answer>
<para>Sie m&uuml;ssen wahrscheinlich Ihren X-Server mit dem Programm <command>xmodmap</command> einrichten, um die Tastencodes der &Windows;tasten n&uuml;tzlichen X Tastensymbolen zuzuordnen. Dabei hilft Ihnen der Befehl <command>xev</command>.</para>
<para>Zuerst m&uuml;ssen Sie eine Datei <filename>$<envar>HOME</envar>/.Xmodmap</filename> erzeugen, die die folgenden Eintr&auml;ge enth&auml;lt:</para>
<screen>
keycode 115=F13
keycode 117=F15
</screen>
<para>Danach f&uuml;hren sie den Befehl <command>xmodmap ~/.Xmodmap</command> aus. Dies veranlasst die <keycap>Start</keycap>-Taste, den Tastencode <keysym>F13</keysym> zu senden und die <keycap>Windows</keycap>-Taste den Tastencode <keysym>F15</keysym>. Als n&auml;chstes starten Sie das <application>&kde;-Kontrollzentrum</application> und w&auml;hlen Sie <menuchoice><guimenu>Tastenzuordnung</guimenu><guimenuitem>Allgemeine Tastenk&uuml;rzel</guimenuitem></menuchoice>. Setzen Sie <keysym>F13</keysym> f&uuml;r <guilabel>Aufklapp-Men&uuml;</guilabel> und <keysym>F15</keysym> f&uuml;r <guilabel>Fenster-Aktionen</guilabel>. Fertig. <note><para>The numbers 115 and 117 may depend on the keyboard. If you are not sure, please check using <command>xev</command>. In addition, the above procedure requires &kde; 1.1 and above.</para> <para>&kikbd; is able to do this too, but keymaps have to be edited. The advantage of &kikbd; is that one can choose whether to use these mappings on several custom keymaps and have them hotswappable.</para> <para>It would be interesting to make a little script that will automatically do the keymap modifications on demand. &kikbd; should be able to read/understand user-side keymap files.</para></note></para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Nach der Installation von &kde; verschwindet das &RedHat; Startmen&uuml;!</para>
</question>
<answer>
<para>F&uuml;hren Sie den Befehl <command>wmconfig <option>--output kde</option></command> aus. Dies erzeugt die &RedHat;-spezifischen Symbole in Ihrem &kde;-Men&uuml;. Wenn Sie dies innerhalb &kde; tun, m&uuml;ssen Sie die &kontrollleiste; neustarten. Die Symbole sind standardm&auml;&szlig;ig im Verzeichnis <filename class="directory">applnk</filename> installiert, aber Sie k&ouml;nnen diese mit &kmenuedit; an jede beliebige Stelle kopieren oder verschieben.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wo finden Sie Informationen zu &kde;-Designs (themes)?</para>
</question>
<answer>
<para>Gehen Sie nach: <ulink url="http://kde.themes.org/">http://kde.themes.org/</ulink>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie &auml;ndern Sie &MIME;-Typen?</para>
</question>
<answer>
<para>If you are using &kfm;, first open a &kfm; window and choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Mime Types</guimenuitem></menuchoice>. Find the type you want to change (<abbrev>e.g.</abbrev> text/english or image/gif), click the right mouse button, select <guimenuitem>Properties</guimenuitem>, choose the <guilabel>Binding</guilabel> tab, and set Default Application to whatever you want.</para>
<para>Wenn Sie &konqueror; benutzen, &ouml;ffnen Sie ein &konqueror;-Fenster, klicken Sie mit der rechten Maustaste auf eine Datei des Typs, den Sie bearbeiten wollen (<abbrev>z.B.</abbrev> text/english oder image/gif) und w&auml;hlen Sie <menuchoice><guimenuitem>Dateitypen bearbeiten...</guimenuitem></menuchoice>. Es &ouml;ffnet sich dann ein Dialogfenster, in dem Sie die aktuellen Dateizuordnungen angezeigt bekommen und diese &auml;ndern k&ouml;nnen.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>&kde; (&kdm;) liest Ihr <filename>.bash_profile</filename> nicht!</para>
</question>
<answer>
<para><application>xdm</application> (und &kdm;) starten keine Loginshell, also werden <filename>.profile</filename>, <filename>.bash_profile</filename>, <abbrev>etc.</abbrev> ignoriert. Beim Anmelden startet <application>xdm</application> den Befehl <command>Xstartup</command> als Systemverwalter und dann <command>Xsession</command> als Nutzer. Schreiben Sie also entsprechende Befehle und Optionen in die Datei <filename>Xsession</filename>, um Ihr Benutzerprofil einzustellen. Editieren Sie die Dateien <filename>Xsession</filename> und <filename>.xsession</filename>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie benutzen Sie &TrueType;-Fonts in &kde;?</para>
</question>
<answer>
<para>Sie m&uuml;ssen die Unterst&uuml;tzung f&uuml;r &TrueType;-Fonts in &X; installieren. Unter <ulink url="http://x.themes.org/">x.themes.org</ulink> finden Sie weitere Informationen &uuml;ber die Fonts und unter <ulink url="http://www.dcs.ed.ac.uk/home/jec/programs/xfsft/">xfsft: &TrueType; Font Support For X11</ulink> oder <ulink url="http://X-TT.dsl.gr.jp/">X-&TrueType; Server Project Home Page</ulink> &uuml;ber die Font-Server.</para>
<para>Wenn Sie einige &TrueType;-Fonts von &Microsoft; &Windows; haben, editieren Sie die Datei <filename>XF86Config</filename>, um die Fonts vom Fonts-Verzeichnis zu erhalten. Dann weisen Sie einfach &kde; mit dem &kde;-Kontrollzentrum an, diese zu benutzen.</para>
<para>Allerdings nutzen viele &kde;-1.0-Anwendungen eigene Dialogfenster und nicht die Fontlisten von &kde;. Sie k&ouml;nnen jedoch die rc-Dateien dieser Anwendungen direkt editieren.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Ist es m&ouml;glich mit dem Euro-Symbol in &kde; zu arbeiten?</para>
</question>
<answer>
<para>Ja und nein. Einzelheiten finden Sie hier: <ulink url="http://monitor.blvk.ch/euro/">http://monitor.blvk.ch/euro/</ulink>.</para>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="applications">
<title>&kde;-Anwendungen</title>

<qandaset>
<qandaentry>
<question>
<para>&kppp;</para>
</question>
<answer>
<para>Viele &kde;-Nutzer berichten &uuml;ber Probleme mit &kppp;. Bevor auch Sie sich jedoch dar&uuml;ber beschweren, &uuml;berpr&uuml;fen Sie bitte folgendes:</para>
<itemizedlist> <listitem><para>K&ouml;nnen Sie ohne &kppp; zu Ihrem <acronym>ISP</acronym> w&auml;hlen? Wenn nicht, dann ist das Problem wahrscheinlich nicht in &kppp; zu suchen.</para></listitem> <listitem><para>Sind Sie die &kppp;-Dokumentation mindestens drei Mal durchgegangen und haben Sie deren Anweisungen und Fehlersuchevorschl&auml;ge befolgt?</para></listitem> </itemizedlist>
<para>Die &kppp;-Dokumentation finden Sie im <application>&kde;-Hilfezentrum</application> oder Sie k&ouml;nnen auch direkt in das Dokumentationsverzeichnis gehen, dies ist normalerweise <filename class="directory">$<envar>KDEDIR</envar>/share/doc/HTML/default/kppp</filename>. Zus&auml;tzlich gibt eine Webseite "How to set up kppp with ISPs in the UK" unter <ulink url="http://www.kppp-archive.freeserve.co.uk/">http://www.kppp-archive.freeserve .co.uk/</ulink>. Zu guter letzt finden Sie die &kppp;-Homepage unter <ulink url="http://devel-home.kde.org/~kppp/">http://devel-home.kde.org/~kppp/</ulink>.</para>
<para>Wenn Sie jetzt immer noch Probleme haben, hier noch einige Hinweise:</para>
<variablelist> <varlistentry><term>Wie &auml;ndern Sie die &MTU;-Einstellung in &kppp;?</term> <listitem><para>&Ouml;ffen Sie das &kppp;-Dialogfenster und w&auml;hlen Sie <guibutton>Einstellungen</guibutton>. W&auml;hlen Sie einen vorhandenen Zugang und klicken Sie dann auf <guibutton>Bearbeiten...</guibutton> oder klicken Sie gleich auf <guibutton>Neu</guibutton>, um einen neuen Zugang zu erstellen. W&auml;hlen Sie die Karteikarte f&uuml;r <guilabel>W&auml;hlen</guilabel> und klicken Sie auf <guibutton>pppd-Argumente bearbeiten...</guibutton>. Geben Sie im Feld <guilabel>Argument</guilabel> das Gew&uuml;nschte ein (<abbrev>z.B.</abbrev> <userinput>mtu 296</userinput>) und klicken Sie auf <guibutton>Hinzuf&uuml;gen</guibutton>. &Uuml;berpr&uuml;fen Sie alle Eingaben im gro&szlig;en Textfeld und klicken Sie auf <guibutton>OK</guibutton>.</para> <para>Zum &Uuml;berpr&uuml;fen, ob Ihre Optionen auch wirksam geworden sind, k&ouml;nnen Sie Verschiedenes tun:</para> <itemizedlist> <listitem><para>F&uuml;hren Sie den Befehl <command>/sbin/ifconfig ppp0</command> in einem Terminal-Fenster aus und sehen Sie nach, ob die &MTU; in der Ausgabe mit dem von Ihnen eingestellten Wert &uuml;bereinstimmt.</para></listitem> <listitem><para>Add <option>debug</option> and <option>kdebug</option> (each on a separate line) to your <filename>/etc/ppp/options</filename> file and restart your &PPP; session. You will find debugging messages in <filename>/var/log/messages</filename>, including &MRU; and &MTU; settings.</para></listitem> </itemizedlist> <para>Wenn Sie wollen, k&ouml;nnen Sie auch die Werte f&uuml;r &MRU; und &MTU; zur Datei <filename>options</filename> hinzuf&uuml;gen. Sie m&uuml;ssen f&uuml;r jede Option eine neue Zeile verwenden, Anf&uuml;hrungszeichen und Trennstriche sind hier verboten.</para></listitem> </varlistentry> <varlistentry> <term>&kppp; verbindet nur mit niedrigen Geschwindigkeiten.</term> <listitem><para>Eventuell hilft folgendes:</para> <itemizedlist> <listitem><para>F&uuml;hren Sie den Befehl <command>setserial spd_hi</command> auf einer Befehlszeile aus.</para></listitem> <listitem><para>Der Standardwert f&uuml;r &MTU; ist 1500. Dies kann f&uuml;r eine Verbindung &uuml;ber das Telefonnetz zu gro&szlig; sein. Versuchen Sie kleinere Werte wie <userinput>296</userinput> oder <userinput>576</userinput>.</para></listitem> <listitem><para>&Uuml;berpr&uuml;fen Sie in Ihrem Verzeichnis <filename class="directory">$<envar>HOME</envar>/.kde/share/config</filename> die Datei <filename>kppprc</filename>. Stellen Sie sicher, dass dort die richtige Modemgeschwindigkeit (Geschwindigkeit der Verbindung zwischen Modem und Rechner) eingestellt ist.</para></listitem> </itemizedlist></listitem> </varlistentry> </variablelist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>&kvt; und &konsole;</para>
</question>
<answer>
<variablelist> <varlistentry> <term>Wie k&ouml;nnen Sie die Anzeige zur&uuml;ckrollen?</term> <listitem><para>Nutzen Sie die Tastenkombinationen <keycombo action="simul"><keycap>Umschalt</keycap><keycap>Bild Auf</keycap></keycombo> und <keycombo action="simul"><keycap>Umschalt</keycap><keycap>Bild Ab</keycap></keycombo> oder die Bildlaufleiste am rechten Fensterrand.</para></listitem> </varlistentry> <varlistentry> <term>Wie schalten Sie das Verhalten der Tasten &Backspace; und <keycap>Delete</keycap> um?</term> <listitem><para>Look under <menuchoice><guimenu>Options</guimenu><guimenuitem>Terminal</guimenuitem></menuchoice> of your console window.</para></listitem> </varlistentry> <varlistentry> <term>Wie kopieren Sie Text von &kvt; (oder &konsole;) zu einer anderen Anwendung?</term> <listitem><para>Wenn Sie z.B. den Befehl <command>ls</command> ausgef&uuml;hrt haben, w&auml;hlen Sie mit der Maus den gew&uuml;schten Text aus und dr&uuml;cken Sie die Tastenkombination <keycombo action="simul">&Strg;<keycap>C</keycap></keycombo>; dann wechseln Sie in das Fenster der Zielanwendung, setzen den Cursor auf den gew&uuml;nschten Platz und dr&uuml;cken <keycombo action="simul">&Strg;<keycap>V</keycap></keycombo>. Sie k&ouml;nnen auch mit der linken Maustaste den gew&uuml;nschten Text ausw&auml;hlen und dann mit der mittleren Maustaste (oder beiden Maustasten gleichzeitig, wenn Sie eine Zwei-Tasten-Maus mit der Emulation f&uuml;r drei Tasten verwenden) auf das Ziel klicken.</para></listitem> </varlistentry> <varlistentry> <term>Wie stellen Sie die Gr&ouml;&szlig;e des Puffers f&uuml;r das Zur&uuml;ckrollen in einem Terminalfenster ein?</term> <listitem> <para>Probieren Sie den Befehl <command>kvt <option>-sl <replaceable>Gr&ouml;&szlig;e</replaceable> </option></command> f&uuml;r &kvt; und <command>konsole <option>-sl <replaceable>Gr&ouml;&szlig;e</replaceable></option> </command> f&uuml;r &konsole;.</para> <tip><para>Wenn Sie &kvt; mit einer unbekannten Option (<abbrev>z.B.</abbrev> <command>kvt <option>-x</option></command>) in einem Terminalfenster starten, wird Ihnen eine Liste der verf&uuml;gbaren Optionen angezeigt.</para></tip></listitem> </varlistentry> </variablelist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>&kmail;</para>
</question>
<answer>
<para>&kmail; hat eine eigene Homepage <ulink url="http://kmail.kde.org">http://kmail.kde.org</ulink>. Dort finden Sie auch eine <acronym>FAQ</acronym>.</para>
<para>Wie exportieren Sie &kmail;-E-Mails nach &Netscape; Mail?</para>
<para>Versuchen Sie (es kann sein, dass Sie daf&uuml;r Systemverwalterrechte brauchen) den Befehl <command>cat $<envar>HOME</envar>/Mail/inbox >> $<envar>MAIL</envar></command> und starten Sie dann &Netscape; Mail und holen sie lokale E-Mail ab.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>&kbiff;</para>
</question>
<answer>
<para>&kbiff; ist ein kleines Programm, dass Sie &uuml;ber empfangene E-Mail informiert und dessen Homepage finden Sie unter: <ulink url="http://www.granroth.org/kbiff">http://www.granroth.org/kbiff</ulink>.</para>
<variablelist> <varlistentry><term>Wie kann ein &kbiff; zwei Postf&auml;cher &uuml;berwachen und die notwendigen Aktionen veranlassen, wenn neue Post eintrifft?</term> <listitem><para>Bekommen Sie viele E-Mails in beiden Postf&auml;chern? Wenn ja, dann ist es besser zwei &kbiff;'s zu verwenden. Wenn nicht, dann w&auml;hlen Sie die Karteikarte <guilabel>Postfach</guilabel> und klicken Sie auf das kleine Postfach-Symbol. Das erzeugt ein neues Postfach in demselben &kbiff;. &kbiff; reagiert dann auf neue E-Mails in jedem der beiden Postf&auml;cher.</para></listitem> </varlistentry> </variablelist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>&ktop;</para>
</question>
<answer>
<para>Warum sehen nichts?</para>
<para>Dies ist ein Fehler, aber einfach zu umgehen. Ver&auml;ndern Sie einfach die Fenstergr&ouml;&szlig;e um ein paar Pixel und alles ist OK.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>&knode;</para>
</question>
<answer>
<variablelist> <varlistentry><term>Wie "killfile"n Sie jemanden?</term> <listitem><para>Diese Funktion ist noch nicht vorhanden und wird voraussichtlich in &kde; 2.1. realisiert.</para></listitem> </varlistentry> <varlistentry><term>Unterst&uuml;tzt &knode; die Auswahl von mehreren Artikeln in der Artikelliste?</term> <listitem><para>Zur Zeit des Schreibens dieser FAQ noch nicht. Es k&ouml;nnte in &kde; 2.1 vorhanden sein.</para></listitem> </varlistentry> </variablelist>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="non-kde-apps">
<title>&kde; mit nicht-&kde; Anwendungen</title>

<qandaset>
<qandaentry>
<question>
<para>Ihre nicht-&kde; Anwendungen wie &Emacs; und <application>kterm</application> spielen verr&uuml;ckt mit riesigen Fenstern und seltsamen Fonts!</para>
</question>
<answer>
<para>Das hat wahrscheinlich damit zu tun, dass &kde; versucht, die "KDE-Standardwerte auf nicht-KDE Anwendungen" (apply KDE defaults to non-KDE apps) anzuwenden, das hei&szlig;t, dass &kde; das Programm <command>xrdb</command> benutzt, um die Standardwerte f&uuml;r Farben, Fonts etc. anzuwenden, die Sie in &kde; entweder eingestellt oder als Standard &uuml;bernommen haben. Leider zeigt die Erfahrung, dass das anderes beeintr&auml;chtigt, besonders, wenn Sie die X-Einstellungen Ihrer nicht-&kde;-Anwendungen sorgf&auml;tig getunt haben.</para>
<para>Die offizielle L&ouml;sung f&uuml;r &kde; 1.x ist: klicken Sie auf den <guibutton>K</guibutton>-Knopf, w&auml;hlen Sie <menuchoice><guimenu>Settings</guimenu> <guisubmenu>Desktop</guisubmenu> <guimenuitem>Style</guimenuitem> </menuchoice> und deaktivieren Sie das Ankreuzfeld "apply KDE settings to non-KDE apps". F&uuml;r &kde; 2, klicken Sie auf den <guibutton>K</guibutton>-Knopf, w&auml;hlen Sie <menuchoice><guimenu>Einstellungen</guimenu> <guisubmenu>Erscheinungsbild</guisubmenu> <guisubmenu>Design</guisubmenu> <guimenuitem>Stil</guimenuitem> </menuchoice> und deaktivieren Sie das Ankreuzfeld <guilabel>Schriftarten und Farben auf Nicht-KDE-Programme anwenden</guilabel>. Wenn die neue Einstellung nicht zu halten scheint, klicken Sie auf den Knopf <guibutton>OK</guibutton> sofort ohne vorher auf <guibutton>Anwenden</guibutton> zu klicken. Wenn es dann immer noch nicht funktioniert, gibt es noch eine gewaltsame L&ouml;sung: L&ouml;schen Sie das Verzeichnis <filename class="directory">$<envar>KDEDIR</envar>/share/apps/kdisplay/app-defaults</filename> oder bennenen Sie es um. &kde; ist dann nicht mehr in der Lage, die X-Resourcen zu finden und das l&ouml;st das Problem. Sie m&uuml;ssen sich ab- und wieder anmelden, damit alles wieder normal funktioniert.</para>
<para>Wenn Sie das systemweite Verzeichnis <filename class="directory">app-defaults</filename> nicht l&ouml;schen oder umbenennen wollen oder k&ouml;nnen, dann k&ouml;nnen Sie auch dieses Verzeichnis in Ihr Pers&ouml;nliches &kde;-Verzeichnis (<abbrev>z.B.</abbrev> <filename class="directory"> $<envar>HOME</envar>/.kde/share/apps/kdisplay/app-defaults</filename>) kopieren und dann einzelne Dateien hierin editieren, l&ouml;schen oder hinzuf&uuml;gen, um Ihre gew&uuml;nschten Einstellungen zu erhalten.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>&Netscape;</para>
</question>
<answer>
<variablelist> <varlistentry> <term>Warum dauert das Laden von &Netscape; so lange?</term> <listitem><para>Das Laden von &Netscape; dauert l&auml;nger, weil es die statische Version von &Motif; benutzt und beim Start alle Elemente der Programmoberfl&auml;che, <abbrev>etc.</abbrev> laden muss.</para></listitem> </varlistentry> <varlistentry> <term>Warum st&uuml;rzt &Netscape; ab, wenn Sie bestimmte Webseiten aufrufen?</term> <listitem><para>Welche Webseiten rufen Sie auf? &Java;-MiniProgramme bewirken h&auml;ufig ein Abst&uuml;rzen von &Netscape;. Da aber die meisten Leute &Java;-MiniProgramme nur f&uuml;r sich drehende Kn&ouml;pfe und nicht f&uuml;r irgendetwas N&uuml;tzliches benutzen, schalten Sie einfach &Java; in &Netscape; aus.</para></listitem> </varlistentry> <varlistentry> <term>Warum zeigt &Netscape; Bilder so seltsam an?</term> <listitem><para>Wenn Sie &Netscape; starten, probieren Sie den Schalter <option>-install</option>; <abbrev>z.B.</abbrev> <command>netscape <option>-install</option> &amp;</command>. Dies zwingt &Netscape; eine eigene Farbpalette zu nutzen, was hoffentlich das Problem l&ouml;st;</para></listitem> </varlistentry> <varlistentry> <term>Wie stellen Sie &Netscape; als Browser f&uuml;r einen neuen WWWUrl kdelnk anstelle von &kfm; ein?</term> <listitem> <para>Sie m&uuml;ssen erst eine <filename>.kdelnk</filename>-Datei f&uuml;r &Netscape; erstellen und diese dann editieren (in &kfm; darauf mit der <mousebutton>rechten Maustaste</mousebutton> klicken und <guimenuitem>Eigenschaften</guimenuitem> ausw&auml;hlen). Hier m&uuml;ssen Sie den richtigen &MIME;-Typ f&uuml;r &URL;s auf der Karteikarte <guilabel>Programme</guilabel> w&auml;hlen; text/html und text/sgml. Dann Klicken Sie mit der <mousebutton>rechten Maustaste</mousebutton> auf eine Datei des gew&uuml;nschten Typs, ignorieren das sich &ouml;ffnende Men&uuml; und w&auml;hlen <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem> Dateitypen bearbeiten...</guimenuitem></menuchoice> aus dem &kfm;-Men&uuml;. Hier k&ouml;nnen Sie dann im Feld <guilabel>Bevorzugte Anordnung von Programmen</guilabel> mit dem Knopf <guilabel>Hinzuf&uuml;gen...</guilabel> &Netscape; hinzuf&uuml;gen und dann mit dem Knopf <guilabel>Entfernen</guilabel> &konqueror; entfernen. Vergessen Sie nicht, auf die Zeile &konqueror; zu klicken, bevor Sie <guilabel>Entfernen</guilabel> bet&auml;tigen.</para></listitem> </varlistentry> </variablelist>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="tips">
<title>N&uuml;tzliche Tipps</title>

<qandaset>
<qandaentry>
<question>
<para>Lesen von Handbuchseiten in &kde;</para>
</question>
<answer>
<para>&Ouml;ffnen Sie das Dialogfenster f&uuml;r das Starten von Anwendungen <abbrev>etc.</abbrev> - standardm&auml;&szlig;ig mit <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> - und geben Sie <command>man:<replaceable>Befehl</replaceable></command> ein. Dies &ouml;ffnet ein &konqueror;-Fenster mit den Handbuchseiten; wenn diese in komprimierter Form gespeichert sind, werden sie automatisch in eine tempor&auml;re Datei entpackt.</para>
<para>Sie k&ouml;nnen auch die <application>&kde;-Hilfe</application> in &kde; verwenden. Starten Sie dies einfach durch Klicken auf den rot-wei&szlig;en Rettungsring oder durch K-Knopf -> Hilfe. Wenn die <application>&kde;-Hilfe</application> gestartet ist, dann finden Sie im linken Fenster einen Eintrag <guilabel>Unix-Handbuchseiten</guilabel>. Wenn sie auf diesen Eintrag klicken, k&ouml;nnen Sie durch alle Handbuchseiten, die auf Ihrem System installiert sind, bl&auml;ttern.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Schnelles Verschieben oder Ver&auml;ndern der Gr&ouml;&szlig;e von Fenstern</para>
</question>
<answer>
<para>Um ein Fenster zu verschieben, k&ouml;nnen Sie die Tastenkombination <keycombo action="simul">&Alt;<mousebutton>linke</mousebutton></keycombo> Maustaste verwenden. <keycombo action="simul">&Alt;<mousebutton>rechte</mousebutton></keycombo> Maustaste ver&auml;ndert die Gr&ouml;&szlig;e des Fensters und <keycombo action="simul">&Alt;<mousebutton>mittlere</mousebutton></keycombo> Maustaste verschiebt das Fenster in den Hintergrund oder holt es wieder hervor. F&uuml;r weitere Information &uuml;ber die Mausfunktionen lesen Sie bitte im "The K Window Manager Handbook" nach. <note><para>&kde; 1.1 and above allows you to change these mouse bindings.</para></note></para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Beenden/Schlie&szlig;en von Fenstern in &kde;</para>
</question>
<answer>
<para>Die Standard-Tastenkombination <keycombo action="simul">&Strg;&Alt;&Esc;</keycombo> schaltet den Cursor in einen Totenkopf um. Klicken Sie mit diesem Cursor auf ein Fenster, um dieses zu schlie&szlig;en. Die Tastenzuordnungen k&ouml;nnen Sie in &kde; Version 1.1. und dar&uuml;ber im <application>&kde;-Kontrollzentrum</application> ansehen oder ver&auml;ndern.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Umschalten von Fenstermanagern ohne Beenden von &kde; in &kde; 1.x</para>
</question>
<answer>
<para>Wenn Sie den Fenstermanager umschalten wollen, ohne &kde; erst zu beenden, dann geben Sie in einem Terminalfenster den folgenden Befehl ein: <command>kwmcom go:<replaceable>blackbox</replaceable></command>. Dies schaltet zum Fenstermanager blackbox um, aber sie k&ouml;nnen blackbox durch jeden Fenstermanager Ihrer Wahl ersetzen.</para>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="misc">
<title>Verschiedenes</title>

<qandaset>
<qandaentry>
<question>
<para>Warum nutzt &kde; &Qt;?</para>
</question>
<answer>
<para>&Qt; ist ein sehr weit entwickelter Satz von Werkzeugen, der Alles enth&auml;lt, was zum Erstellen einer modernen Benutzerschnittstelle gebraucht wird. &Qt; ist in C++ geschrieben, das objektorientiertes Programmieren erlaubt. Das hinwiederum sichert Effizienz und einfache Wiederverwendung von einmal geschriebenen Programmen auch in einem Projekt der Gr&ouml;&szlig;e und Ausrichtung von &kde;. Unserer Meinung nach gibt es keinen besseren Werkzeugsatz f&uuml;r &UNIX;-Systeme und es w&auml;re ein unverzeihlicher Fehler, &kde; mit etwas anderem als dem Besten zu programmieren.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Warum nutzt &kde; nicht gtk, xforms, xlib oder anderes?</para>
</question>
<answer>
<para>Es gibt eine Anzahl von anderen Werkzeugs&auml;tzen. Um aber eine durchg&auml;ngige Benutzeroberfl&auml;che und einen minimalen Ressourcenverbrauch (z.B. Hauptspeicher) zu sichern, kann &kde; nur EINEN Werkzeugsatz verwenden. &Qt; wurde aus den oben erl&auml;uterten Gr&uuml;nden ausgew&auml;hlt.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Aber &Qt; ist nicht frei, oder doch?</para>
</question>
<answer>
<para>Doch, es ist! Beginnend mit der am 4. September 2000 herausgegebenen Version 2.2 sind die &Qt;-Bibliotheken unter der <acronym>GPL</acronym> lizensiert, die alle Aspekte von "freier Software" erf&uuml;llt.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie "mounten" Sie Filesysteme (<abbrev>z.B.</abbrev> mein <hardware>CD-ROM Laufwerk</hardware>) in &kde;?</para>
</question>
<answer>
<para>Um Ihr <hardware>CD-ROM Laufwerk</hardware> in &kde; zu mounten, m&uuml;ssen Sie (mit Systemverwalterrechten) als erstes die folgende Zeile zur Datei <filename>/etc/fstab</filename> hinzuf&uuml;gen:</para>
<screen>
/dev/cdrom     /cdrom     iso9660  ro,user,noauto,unhide
</screen>
<para>&Uuml;berpr&uuml;fen Sie, dass Ihr System einen symbolischen Link von <filename class="symlink">/dev/cdrom</filename> zur Ger&auml;tedatei /dev/hd?, an die Ihr <hardware>CD-ROM Laufwerk</hardware> angeschlossen ist, hat. (Vorausgesetzt, Sie nutzen ein &ATAPI; <hardware>CD-ROM Laufwerk</hardware>). Sie sollten auf den Befehl <command>ls -l /dev/cdrom</command> ungef&auml;hr folgende Antwort erhalten:</para>
<screen>
lrwxrwxrwx   1 root     root            8 Jul 28 22:21 /dev/cdrom -> /dev/hdb
</screen>
<para>Um diesen Link zu erzeugen, m&uuml;ssen Sie den folgenden Befehl ausf&uuml;hren: <command>ln -s /dev/hdb /dev/cdrom</command> (als Systemverwalter). Sie brauchen au&szlig;erdem einen g&uuml;ltigen Mountpunkt, um das <hardware>CD-ROM Laufwerk</hardware> in das Dateisystem einzubinden, z.B.:</para>
<screen>
% ls -la /cdrom
total 2
drwxrwsr-x   2 root     cdrom        1024 Sep 14  1995 ./
drwxr-xr-x  24 root     root         1024 Dec  1 21:00 ../
</screen>
<para>Nun k&ouml;nnen Sie das Laufwerk von einer Befehlszeile mit dem Befehl <command>mount /cdrom</command> mounten (einbinden). Sie k&ouml;nnen auch ein &kde;-Ger&auml;te-Symbol f&uuml;r das <hardware>CD-ROM Laufwerk</hardware> auf Ihrer Arbeitsfl&auml;che platzieren. Klicken auf dieses Symbol mountet das <hardware>CD-ROM Laufwerk</hardware> automatisch f&uuml;r Sie. Wie Sie dieses Symbol erzeugen, finden Sie in der &kde;-Benutzeranleitung.</para>
<para>Weitere Informationen &uuml;ber das Mounten von Dateisystemen erhalten sie, wenn Sie die Befehle <command>man fstab</command> oder <command>man mount</command> ausf&uuml;hren.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Hat &kde; Terminal-Emulatoren mit transparentem Hintergrund?</para>
</question>
<answer>
<para>Ja und nein. &konsole; besitzt die F&auml;higkeit, den Hintergrund innerhalb des &konsole;-Fenster nachzuzeichnen. Das erzeugt den Anschein von Transparenz, aber wenn sie das &konsole;-Fenster &uuml;ber einem anderen Fenster platzieren, geht die Transparenz verloren. Das Programm <ulink url="http://www.eterm.org">Eterm</ulink> sollte ohne Probleme funktionieren, wenn Sie mehr Transparenz wollen.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Gibt es eine M&ouml;glichkeit, einige Informationen &uuml;ber meine Laufwerke zu erfahren: freier Platz, Verzeichnisgr&ouml;&szlig;e <abbrev>usw.</abbrev>?</para>
</question>
<answer>
<para>Die &kde;-Systemkontrolle l&auml;sst Sie in jedes Laufwerk sehen und gibt Ihnen Informationen dar&uuml;ber. F&uuml;r weitere Einzelheiten nutzen Sie die Befehle <command>df</command> und <command>du</command>. Einzelheiten hierzu finden Sie, wenn Sie in einem Terminal-Fenster <command>man df</command> bzw. <command>man du</command> eingeben. Beispielsweise zeigt Ihnen der Befehl <command>du <option>-h <replaceable>Verzeichnis</replaceable></option></command> eine Liste mit der Gr&ouml;&szlig;e des Verzeichnisses und der darin vorhandenen Unterverzeichnisse - wenn vorhanden.</para>

</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie stellen Sie die korrekte Funktion der &Backspace;-Taste unter &kde; ein?</para>
</question>
<answer>
<para>F&uuml;hren Sie den Befehl <command>xmodmap <option>-e 'keycode 22 = BackSpace'</option></command> aus und sehen Sie nach, ob dies die richtige Funktion herstellt (Anwendungen m&uuml;ssen neu gestartet werden, damit die &Auml;nderungen wirksam werden). Wenn ja, dann k&ouml;nnen Sie diesen Befehl einfach in Ihrer X-Startup-Datei wie <filename>.xinitrc</filename> eintragen.</para>
<para>Eine andere M&ouml;glichkeit ist, auf XFree86-3.3.3.1-1 oder h&ouml;her zu wechseln.</para>
<para><note><para>Also, concerning the &Backspace;-Bug (Bug number: kb704): the bug is fixed somehow by putting the following line into <filename>$<envar>HOME</envar>/.xinitrc</filename>: <screen>
xmodmap -  "keysym Delete = BackSpace"
</screen> </para></note></para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie erzeugen Sie Symbole f&uuml;r nicht-&kde;-Anwendungen, die Sie in das <guimenu>K</guimenu>-Men&uuml; einf&uuml;gen k&ouml;nnen? Wo werden diese Symbole (oder kdelnk's) gespeichert?</para>
</question>
<answer>
<para>Erzeugen Sie diese mit Ihrem bevorzugten Bildverarbeitungsprogramm, z.B. <application>GIMP</application> und speichern Sie diese im Verzeichnis <filename class="directory">$<envar>KDEDIR</envar>/share/icons(/mini)</filename> oder <filename class="directory">$<envar>HOME</envar>/.kde/share/icons(/mini)</filename>. Nebenbei erw&auml;hnt, der <application>&kde; Symbol Editor</application> wird vom &kde;-Team zur Zeit entwickelt. Weitere Informationen hierzu finden Sie unter: <ulink url="http://w1.1358.telia.com/~u135800018/prog.html#KICONEDIT"> http://w1.1358.telia.com/~u135800018/prog.html#KICONEDIT</ulink>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie bekommen Sie &kde;-Programme, die keine Symbole haben, in das Men&uuml;?</para>
</question>
<answer>
<para>Benutzen Sie &kmenuedit;.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Hat &kde; einen graphischen &FTP;-Client?</para>
</question>
<answer>
<para>Ja und in &kde; 1.x ist das kein anderer als der Dateimanager &kfm;! Sie k&ouml;nnen Dateien von entfernten Servern einfach durch Ziehen und Ablegen in lokale Verzeichnisse kopieren. Es gibt ausserdem ein Dienstprogramm mit Namen <application>KGet</application> das die Wiederaufnahme von abgebrochenen Downloads und die Organisation von Warteschleifen erlaubt, dieses k&ouml;nnen Sie zusammen mit &kfm; verwenden (Sie k&ouml;nnen Dateien einfach in <application>KGet</application> ziehen, aber Sie k&ouml;nnen dieses nicht zum Browsen in &FTP;-Servern verwenden).</para> 
<para>F&uuml;r &kde; 2, nutzen Sie &konqueror;.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie verlassen Sie &kde;?</para>
</question>
<answer>
<para>Klicken Sie einfach auf den <guibutton>K</guibutton>-Knopf und w&auml;hlen Sie <guimenu>Abmelden...</guimenu>. Sie k&ouml;nnen auch einfach mit der <mousebutton>rechten</mousebutton> Maustaste auf eine leere Stelle der Arbeitsfl&auml;che klicken, was ein Men&uuml; &ouml;ffnet, das Ihnen unter anderem den Punkt <guimenu>Abmelden...</guimenu> anbietet. <note><para><keycombo action="simul">&Ctrl;&Alt;&Backspace;</keycombo> will also do the trick by killing the X server, but its use prevents session management.</para></note></para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Gibt es ein Programm, das nachsieht, ob neue E-Mail angekommen ist und dies nur tut, wenn das System online ist?</para>
</question>
<answer>
<para>&kbiff; oder &korn; k&ouml;nnen dies. Wenn das System nicht mit dem Internet verbunden ist, wartet jedes der beiden nur ab.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Ist es wirklich n&ouml;tig, die letze Version zu benutzen?</para>
</question>
<answer>
<para>Nicht unbedingt. Wenn Sie mit Ihrem &kde;, so wie es ist, zufrieden sind, gibt es keinen Grund, daran etwas zu &auml;ndern. Wenn Sie aber kleine Verbesserungen, schnellere Ausf&uuml;hrung und mehr Funktionen wollen, dann sollten Sie die neueste stabile Version verwenden.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie k&ouml;nnen Sie Kopieren und Einf&uuml;gen in &kde;?</para>
</question>
<answer>
<para>Die einfachste Methode ist das Benutzen der Maus:</para>
<procedure> <step performance="required"><para>Markieren Sie den Text, den Sie kopieren m&ouml;chten, durch Festhalten der linken Maustaste und Ziehen des Cursors &uuml;ber den Text.</para></step> <step performance="required"><para>Gehen Sie mit dem Cursor an die Stelle, in die Sie den Text einf&uuml;gen m&ouml;chten - eventuell m&uuml;ssen Sie hier die linke Maustaste einmal klicken, um die Anwendung in den vordergrund zu holen.</para></step> <step performance="required"><para>Klicken Sie die mittlere Maustaste, um den Text einzuf&uuml;gen. Wenn Sie eine Zweitastenmaus verwenden, dann wird dieses durch Dr&uuml;cken von beiden Maustasten gleichzeitig emuliert.</para></step> </procedure>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie k&ouml;nnen Sie die Standard &RedHat;-Men&uuml;s in das <guimenu>K</guimenu>-Men&uuml; umwandeln?</para>
</question>
<answer>
<para>Klicken Sie auf den <guibutton>K</guibutton>-Knopf und w&auml;hlen Sie <menuchoice><guimenu>System</guimenu><guimenuitem>Anwendungssuche</guimenuitem> </menuchoice>.</para>
</answer>
</qandaentry>

<qandaentry>
<question id="CVS">
<para>Was ist <acronym>CVS</acronym>?</para>
</question>
<answer>
<para>Dies steht f&uuml;r Concurrent Versions System. Es ist ein Versionskontrollsystem und basiert auf <acronym>RCS</acronym> (Revision Control System), aber bietet mehr Funktionailt&auml;t. Es wird zur Wartung von Quellcode in der Entwicklung verwendet. Es kann verschiedene Versionen von Programmen speichern (n&uuml;tzlich, wenn Sie mit einer neuen Version irgendetwas st&ouml;ren und deswegen zu einer &auml;lteren, korrekt arbeitenden Version zur&uuml;ckgehen m&uuml;ssen) und es gestattet den Entwicklern und allen Anderen mit den entsprechenden Rechten, &uuml;ber das Internet die neuesten Quellen zu holen oder &Auml;nderungen in das Projekt einzubringen. Es ist auch ein Open-Source-System (Sie m&uuml;ssen nur f&uuml;r Unterst&uuml;tzung bezahlen, wenn Sie diese m&ouml;chten), und da freie Nutzung erlaubt, ist es das System der Wahl, wenn Leute sich zusammenfinden, um freie Software wie &kde; zu entwickeln.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Unterst&uuml;tzt &kde; zwei Bildschirme (Xinerama)?</para>
</question>
<answer>
<para>Sie brauchen dazu einen X-Server, der dies unterst&uuml;tzt (<abbrev>z.B.</abbrev> MetroX oder XFree86 4.0 und h&ouml;her) und einen Fenstermanager, der sogenanntes multi-headed Display versteht (<abbrev>z.B.</abbrev> &windowmaker;).</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie finden Sie heraus, welche Version von &kde; Sie nutzen?</para>
</question>
<answer>
<para>Starten Sie das <application>&kde;-Kontrollzentrum</application>. Wenn es dort keine Versionsanzeige auf dem ersten Bildschirm gibt dann nutzen Sie Version 1.0 (und es ist Zeit zum Wechseln!).</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>K&ouml;nnen Sie kommerzielle Software f&uuml;r &kde; schreiben?</para>
</question>
<answer>
<para>Sie k&ouml;nnen die &kde;-Bibliotheken zum Schreiben von Software vom Typ "kommerziell und nicht&ouml;ffentliche Quellen" sowie "kommerziell und &ouml;ffentliche Quellen" benutzen. Wenn Sie Open-Source Software schreiben, k&ouml;nnen Sie die freie Ausgabe von &Qt; benutzen. Wenn Sie jedoch den Quellcode nicht ver&ouml;ffentlichen wollen, dann m&uuml;ssen Sie eine Lizenz f&uuml;r die Professional Edition von &Qt; von Troll Tech erwerben. </para>
<para>Nehmen Sie direkt Verbindung mit <ulink url="http://www.trolltech.com">Troll Tech</ulink> auf, wenn Sie n&auml;here Einzelheiten wissen m&ouml;chten.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Warum zeigt das <application>&kde;-Kontrollzentrum</application> Ihre Version als 2.0pre an, obwohl Sie die neueste Version benutzen?</para>
</question>
<answer>
<para>Dies ist ein Fehler und ist im <acronym>CVS</acronym> in Ordnung gebracht worden.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie erzeugen Sie neue Designs und Symbole?</para>
</question>
<answer>
<para>Sehen Sie sich <ulink url="http://artist.kde.org">http://artist.kde.org</ulink> an.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Ist die Anwendung <application>KLyX</application> aufgegeben?</para>
</question>
<answer>
<para>Ja. Zuk&uuml;nftige Versionen von <application>LyX</application> werden &GUI;-unabh&auml;ngig sein. Sie finden Informationen hierzu unter: <ulink url="http://devel.lyx.org/guii.php3">here</ulink>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie erfahren Sie neue Entwicklungsschritte?</para>
</question>
<answer>
<para>Sie k&ouml;nnen die verschiedenen &kde; Mailing Listen abbonnieren, besonders kde-cvs, die &uuml;ber alle &Auml;nderungen im &kde; <acronym>CVS</acronym>-Teil informiert. Sehen Sie unter <ulink url="http://lists.kde.org">http://lists.kde.org</ulink> nach, wenn Sie diese Informationen lesen wollen, ohne die Listen zu abbonnieren.</para>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="not-kde">
<title>Nicht wirklich &kde;-bezogen, aber trotzdem oft gefragt</title>

<qandaset>
<qandaentry>
<question>
<para>Wie schalten sie die Bildschirmaufl&ouml;sung um?</para>
</question>
<answer>
<para>Die Tastenkombinationen <keycombo action="simul">&Strg;&Alt;<keycap>+</keycap></keycombo> und <keycombo action="simul">&Strg;&Alt;<keycap>-</keycap></keycombo> schalten zwischen den in <filename>XF86Config</filename> (eventuell im Verzeichnis <filename class="directory">/etc/X11</filename> definierten Aufl&ouml;sungen um. Sie k&ouml;nnen auch diese Datei direkt editieren. Wenn Sie die bevorzugte Aufl&ouml;sung als erste in der Datei anordnen (oder als einzige darin stehen lassen), startet &X; immer mit dieser Aufl&ouml;sung. <caution><para>Always make a backup copy of your <filename>XF86Config</filename> file <emphasis>before</emphasis> you start editing it. Errors in this file can render your &X; unusable.</para></caution> <note><para>These instructions are only valid if you are running version 3.3.x of the XFree86 server. If you are running XFree86 4.x, you must consult with the <ulink url="http://xfree.org">XFree86(TM): Home Page</ulink>.</para></note></para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie &auml;ndern Sie die Farbtiefe?</para>
</question>
<answer>
<para>Soweit bekannt ist, gibt es keine M&ouml;glichkeit dies an einem laufenden &X;-Server zu tun. Sie k&ouml;nnen entweder zum Starten von &X; den Befehl <command>startx <option> -bpp <replaceable>Anzahl</replaceable></option></command> benutzen, wobei <replaceable>Anzahl</replaceable> 8, 16, 24, or 32 sein kann, abh&auml;ngig von der gew&uuml;nschten Farbtiefe oder wenn Sie <application>xdm</application>/&kdm; benutzen, dann m&uuml;ssen Sie die Datei <filename>/etc/X11/xdm/Xservers</filename> (o.&auml;.) editieren und die Zeile <userinput>:0 local /usr/X11R6/bin/X -bpp 16</userinput> hinzuf&uuml;gen, um die Farbtiefe 16 einzustellen.</para>
<para>Als Alternative dazu k&ouml;nnen Sie auch die Datei <filename>XF86Config</filename> editieren und eine Zeile wie <userinput>DefaultColorDepth <replaceable>number</replaceable></userinput> zur Section "Screen" hinzuf&uuml;gen. Beim n&auml;chsten Start l&auml;uft &X; dann mit der neuen Farbtiefe.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>K&ouml;nnen Sie auch mit einer Zweitastenmaus arbeiten?</para>
</question>
<answer>
<para>Kaufen Sie eine Dreitastenmaus oder nutzen Sie die Emulierung f&uuml;r die dritte Taste. Diese wird durch gleichzeitiges Dr&uuml;cken der linken Maustaste und der rechten Maustaste emuliert. Dies muss in der Datei <filename>XF86Config</filename> mit der Option <option>Emulate3Buttons</option> eingestellt sein. </para> 
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Was ist ein "sticky" Fenster?</para>
</question>
<answer>
<para>In einer virtuellen Arbeitsfl&auml;chenumgebung mit mehereren virtuellen Arbeitsfl&auml;chen wird ein "sticky" Fenster auf allen Arbeitsfl&auml;chen angezeigt. Es ist, als w&uuml;rde dieses Fenster am Glas des Monitors kleben. <application>Xclock</application> ist ein typischer Kandidat f&uuml;r die Nutzung dieser Eigenschaft. </para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie ersetzen Sie den "X"-Mauszeiger mit einem Pfeil?</para>
</question>
<answer>
<para>Die verschiedenen Typen f&uuml;r Mauszeiger in &X; sind in der Datei <filename class="headerfile">X11/cursorfont.h</filename> definiert. Sie k&ouml;nnen diese &auml;ndern, indem Sie den Befehl <command>xsetroot -cursor_name <replaceable>name_of_cursor</replaceable></command> ausf&uuml;hren. Zum Beispiel steht in meiner Datei <filename>.Xclients</filename>:</para>
<screen>
xsetroot -cursor_name left_ptr
</screen>
<para>Dies erzeugt den bekannten links-gewinkelten Zeiger. Um andere Alternativen zu sehen, geben Sie den Befehl: <command>xfd -fn cursor</command> ein. Vergessen Sie nicht, mit <command>man xsetroot</command> um Rat zu fragen, wenn Sie hier nicht weiterwissen.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie entpacken/installieren Sie diff-Dateien?</para>
</question>
<answer>
<para>Um eine diff-Datei, die f&uuml;r das "Patchen" von Quelltext-Dateien nutzbar ist, zu erzeugen, f&uuml;hren Sie den Befehl <command>diff <replaceable>old-file new-file</replaceable> > <replaceable>patchfile</replaceable></command> aus. Um diese &Auml;nderungen in eine andere Datei einzuspielen, (<abbrev>z.B.</abbrev> "patch the file"), f&uuml;hren Sie den Befehl <command>patch &lt; <replaceable>patchfile</replaceable></command> aus.</para> </answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie &uuml;berzeugen Sie &Linux; sowohl ext2- als auch dos-Disketten zu mounten?</para>
</question>
<answer>
<para>Sie m&uuml;ssen das Dateisystem als "auto" in der entsprechenden Zeile in <filename>/etc/fstab</filename> angeben. Dann wird der Typ der Diskette beim Mounten automatisch erkannt.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie starten Sie &kde; mit <keycap>Num Lock</keycap> ein?</para>
</question>
<answer>
<para>Haben Sie schon unter <command>man setleds</command> nachgesehen? Zus&auml;tzlich k&ouml;nnen Sie auch noch Ihre Datei <filename>$<envar>HOME</envar>/.Xmodmap</filename> editieren und die folgenden Zeilen darin einf&uuml;gen:</para>
<screen>
! redefines numeric keypad to be used without NumLock
keycode 79 = 7
keycode 80 = 8
keycode 81 = 9

keycode 83 = 4
keycode 84 = 5
keycode 85 = 6

keycode 87 = 1
keycode 88 = 2
keycode 89 = 3

keycode 90 = 0
keycode 91 = comma
keycode 86 = plus

! deactivates NumLock key
keycode 77 =            
</screen>
<para>Andere m&ouml;gliche Alternativen:</para>
<itemizedlist> <listitem><para>Das Programm <application>xkeycaps</application>: Klicken mit der <mousebutton>rechten Maustaste</mousebutton> darauf sollte Einstellungen erlauben. Es kann sein, dass dies nur mit Systemverwalterrechten m&ouml;glich ist.</para></listitem> <listitem><para><command>man XF86Config</command> und sehen Sie unter Sektion Keyboard nach.</para></listitem> <listitem><para>Installieren Sie <application>NumLockX</application>, das Sie auf der Seite <ulink url="http://dforce.sh.cvut.cz/~seli/en/numlockx">http://dforce.sh.cvut.cz/~seli/ en/numlockx</ulink> finden.</para></listitem> </itemizedlist>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie bekommen Sie Bildschirmfotos?</para>
</question>
<answer>
<para>Benutzen Sie &ksnapshot;.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Gibt es eine Anwendung zum Erstellen von Webseiten?</para>
</question>
<answer>
<para>Ja, eine ganze Menge, <abbrev>z.B.</abbrev> <application>StarOffice</application>, <application>&Netscape; Composer</application>, und <application>XEmacs</application>. Es gibt auch viele &kde;-Anwendungen. Um die aktuellste zu finden sehen Sie unter: <ulink url="http://apps.kde.com">APPS.&kde;.com: The Latest in &kde; Applications</ulink> nach und suchen Sie nach <emphasis>web development</emphasis>. Probieren Sie so viele wie m&ouml;glich aus und entscheiden Sie sich f&uuml;r die Ihnen am meisten dienliche.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Was bedeuten alle diese Abk&uuml;rzungen wie AFAIK?</para>
</question>
<answer>
<para><screen>
AAMOF: as a matter of fact
AFAIK: as far as I know
AISE: as I see it
BFN: bye for now
BION: believe it or not
BRB: be right back
BTW: by the way
CMIIW: correct me if I am wrong
FUD: fear, uncertainty, and doubt
FWIW: for what it's worth
FYI: for your information
HTH: hope this helps
IIRC: if I recall correctly
IMHO: in my humble opinion
LOL: laughing out loud
MYOB: mind your own business
PITA: pain in the ass
ROTFL: rolling on the floor laughing
RTFM: read the fine manual
SOP: standard operating procedure
TIA: thanks in advance
YMMV: your mileage may vary
</screen></para>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="more-info">
<title>Erhalten von weiterer Information</title>

<qandaset>
<qandaentry>
<question>
<para>Wo ist die &kde; Homepage?</para>
</question>
<answer>
<para>Die Adresse der &kde;-Homepage ist: <ulink url="http://www.kde.org">http://www.kde.org</ulink>. Es gibt einige lokale Spiegelserver, die Sie der Hauptseite vorziehen sollten. Sie finden eine aktuelle Liste der Spiegelserver immer unter: <ulink url="http://www.kde.org/webmirrors.html">http://www.kde.org/webmirrors.html </ulink>.</para>
</answer>
</qandaentry>

<qandaentry>
<question id="mailing-lists">
<para>Gibt es eine &kde; Mailing Liste?</para>
</question>
<answer>
<para>Es gibt mehrere. Jede hat einen anderen Schwerpunkt um &kde; herum. Einige sind den Entwicklern vorbehalten, diese sind hier nicht im Detail beschrieben. Einige der wichtigsten Listen sind:</para>
<variablelist> <varlistentry><term>kde</term> <listitem><para>Dies ist die &kde;-Hauptmailingliste f&uuml;r generelle Diskussionen.</para></listitem> </varlistentry> <varlistentry><term>kde-announce</term> <listitem><para>Diese Liste wird zur Ank&uuml;ndigung von neuen Versionen von &kde; wie auch von neuen Werkzeugen und Anwendungen benutzt.</para></listitem> </varlistentry> <varlistentry><term>kde-user</term> <listitem><para>Hier helfen &kde;-Nutzer anderen &kde;-Nutzern.</para></listitem> </varlistentry> <varlistentry><term>kde-look</term> <listitem><para>Diese Liste behandelt Fragen des Erscheinungsbildes und generelle Fragen zur Nutzeroberfl&auml;che.</para></listitem> </varlistentry> <varlistentry><term>kde-licensing</term> <listitem><para>Diese Liste ist Fragen der Lizensierung von &kde; und &Qt; gewidmet.</para></listitem> </varlistentry> </variablelist>
<para>Eine komplette Liste der vorhandenen Mailinglisten finden Sie unter: <ulink url="http://www.kde.org/contact.html">http://www.kde.org/contact.html</ulink>.</para>
<para>Beachten Sie bitte, dass es als unh&ouml;flich angesehen wird, wenn sie in Mailinglisten Fragen stellen, die in einer <acronym>FAQ</acronym> beantwortet werden.</para>
</answer>
</qandaentry>

<qandaentry>
<question id="subscribe">
<para>Wie abonnieren Sie Mailing Listen / bestellen Sie diese wieder ab?</para>
</question>
<answer>
<para>Alle Listen sind &uuml;ber die Universit&auml;t von T&uuml;bingen erreichbar.</para>
<para>Zum Abonnieren:</para>
<para>Senden Sie eine E-Mmail an list-request, das ist im Einzelnen:</para>
<itemizedlist> <listitem><para><ulink url="mailto:kde-request@kde.org">kde-request@kde.org</ulink></para></listitem> <listitem><para><ulink url="mailto:kde-announce-request@kde.org">kde-announce-request@kde.org</ulink></para></listitem> <listitem><para><ulink url="mailto:kde-user-request@kde.org">kde-user-request@kde.org</ulink></para></listitem> <listitem><para><ulink url="mailto:kde-look-request@kde.org">kde-look-request@kde.org</ulink></para></listitem> <listitem><para><ulink url="mailto:kde-licensing-request@kde.org">kde-licensing-request@kde.org</ulink></para></listitem> </itemizedlist>
<para>Die E-Mail muss enthalten: <userinput>subscribe <replaceable>Ihre_E-Mail_Adresse</replaceable></userinput> in der Betreff-Zeile.</para>
<para>Zum Abbestellen:</para>
<para>Senden Sie eine E-Mmail an list-request, das ist im Einzelnen:</para>
<itemizedlist> <listitem><para><ulink url="mailto:kde-request@kde.org">kde-request@kde.org</ulink></para></listitem> <listitem><para><ulink url="mailto:kde-announce-request@kde.org">kde-announce-request@kde.org</ulink></para></listitem> <listitem><para><ulink url="mailto:kde-user-request@kde.org">kde-user-request@kde.org</ulink></para></listitem> <listitem><para><ulink url="mailto:kde-look-request@kde.org">kde-look-request@kde.org</ulink></para></listitem> <listitem><para><ulink url="mailto:kde-licensing-request@kde.org">kde-licensing-request@kde.org</ulink></para></listitem> </itemizedlist>
<para>The email must contain <userinput>unsubscribe <replaceable>your_email_address</replaceable></userinput> in the subject. <important><para>Never send subscribe/unsubscribe request to the mailing lists directly! Use the list-request instead.</para></important></para>
<para>Es gibt au&szlig;erdem eine komplette Liste aller &kde;-bezogenen Mailing Listen sowie ein WWW-basiertes Interface zum Abonnieren/Abbestellen unter: <ulink url="http://master.kde.org/mailman/listinfo">http://master.kde.org/mailman/listinfo </ulink>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Gibt es Archive der Mailing Listen?</para>
</question>
<answer>
<para>Ja, diesen wird von <ulink url="http://www.progressive-comp.com">Progressive Computer Concepts</ulink> Heimat geboten. Die Adresse zur Benutzung ist: <ulink url="http://lists.kde.org">http://lists.kde.org</ulink>. Dort sehen Sie ein Verzeichnis der Mailinglisten. Beachten Sie bitte, dass Sie auf diesem Niveau nur eine Suche nach Betreff oder Autor durchf&uuml;hren k&ouml;nnen. Sie werden damit wahrscheinlich nicht finden, was Sie suchen.</para>
<para>Um auch in den Inhalten zu suchen, m&uuml;ssen Sie in eine der Mailinglisten hineingehen. Klicken Sie einfach auf das Verzeichnissymbol der gew&uuml;nschten Liste (<abbrev>z.B.</abbrev> "kde" oder "kde-user") und im Ausklappmen&uuml; neben dem Feld "search" ist dann standardm&auml;&szlig; "Body" eingestellt. Um gr&uuml;ndlich zu sein, sollten Sie wenigstens die Listen "kde", "kde-user" und "kde-devel" durchsuchen. </para>
</answer>
</qandaentry>

<qandaentry>
<question id="newsgroups">
<para>Gibt es eine Newsgroup &uuml;ber &kde;?</para>
</question>
<answer>
<para>Ja! Diese hei&szlig;t <literal>comp.windows.x.kde</literal>. Zus&auml;tzlich gibt es noch eine deutsche Newsgroup mit Namen <literal>de.alt.comp.kde</literal>. Beachten Sie, dass es auch hier als unh&ouml;flich gilt, Fragen zu stellen, die in einer <acronym>FAQ</acronym> eantwortet werden.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Gibt es andere &kde;-bezogene <acronym>FAQ</acronym>'s?</para>
</question>
<answer>
<para>Ja. Hier ist eine - wahrscheinlich unvollst&auml;ndige Liste:</para>
<itemizedlist> <listitem><para><ulink url="http://www.kde.org/info/faq.html">&kde; 2.0 <acronym>FAQ</acronym></ulink></para></listitem> <listitem><para><ulink url="http://www.konqueror.org/faq.html">&konqueror; <acronym>FAQ</acronym></ulink></para></listitem> <listitem><para><ulink url="http://space.twc.de/~stefan/kde/arts-mcop-doc/artsd-faq.html">aRts Sound Server <acronym>FAQ</acronym></ulink></para></listitem> <listitem><para><ulink url="http://kmail.kde.org/manual/faq.html">&kmail; <acronym>FAQ</acronym></ulink></para></listitem> </itemizedlist>
</answer>
</qandaentry>

</qandaset>
</chapter>

<chapter id="contribute">
<title>Mithelfen</title>

<qandaset>
<qandaentry>
<question>
<para>Wie k&ouml;nnen Sie bei &kde; mithelfen?</para>
</question>
<answer>
<para>&kde; ist ein Software Projekt, das - da das Endprodukt frei ist - von freiwilligen Spenden lebt. Diese k&ouml;nnen in vielen Formen helfen. Jeder ist willkommen, zum Erfolg von &kde; beizutragen. Nicht nur Programmierer sind willkommen. Es gibt jede Menge andere Wege, um mitzuhelfen, &kde; zu verbessern:</para>
<itemizedlist> <listitem><para>Testen Sie die Software.</para></listitem> <listitem><para>Schicken Sie Fehlerberichte. F&uuml;r weitere Informationen hierzu sehen Sie unter <link linkend="bug-report">Wie verfassen Sie einen Fehlerbericht?</link> nach.</para></listitem> <listitem><para>Schreiben Sie Dokumentation oder Hilfedateien. Weitere Informationen hierzu finden Sie unter <ulink url="http://i18n.kde.org/teams/en/index.html">&kde; Editorial Team Home Page</ulink>.</para></listitem> <listitem><para>&Uuml;bersetzen Sie Programme, Dokumentation und Hilfedateien. Weitere Informationen hierzu finden Sie unter <ulink url="http://i18n.kde.org">The &kde; Translators' and Documenters' Web Site</ulink> oder gleich in Deutsch unter <ulink url="http://i18n.kde.org/teams/de">KDE &Uuml;bersetzungsprojekt: Deutsch</ulink>.</para></listitem> <listitem><para>Zeichnen oder malen Sie h&uuml;bsche Symbole oder komponieren Sie Soundeffekte. Sie sollten die <ulink url="http://www.kde.org/artist/index.html">&kde; K&uuml;nstlerseite</ulink> besuchen, um mehr dar&uuml;ber herauszufinden.</para></listitem> <listitem><para>Schreiben Sie Artikel und B&uuml;cher &uuml;ber &kde;. Wenn Sie helfen wollen, &kde; bekannt zu machen, schicken Sie einfach eine E-Mail an: <email>kde-pr@kde.org</email>. Die Freiwilligen Helfer f&uuml;r &Ouml;ffentlichkeitsarbeit werden sich dann um Sie k&uuml;mmern.</para></listitem> <listitem><para>Programmieren Sie neue &kde; Anwendungen. Bitte sehen Sie unter <xref linkend="programming"/> f&uuml;r weitere Informationen nach.</para></listitem> <listitem><para> Sponsoren sind nat&uuml;rlich auch sehr willkommen. :-)</para></listitem> </itemizedlist>
<para>Es gibt einige Stellen, wo Sie nachsehen k&ouml;nnen, wenn Sie sich beteiligen wollen. Der erste Schritt ist das Abonnieren von einigen der Mailing Listen. Dort werden Sie sicher bald etwas sehen, was verbessert werden k&ouml;nnte oder auch noch ganz fehlt.</para>
</answer>
</qandaentry>

<qandaentry>
<question id="bug-report">
<para>Wie senden Sie einen Fehlerbericht?</para>
</question>
<answer>
<para>Es gibt ein automatisches Fehlerverfolgungssystem auf der Webseite <ulink url="http://buglist.kde.org">http://buglist.kde.org</ulink>. Das System stellt ein Formular bereit, mit dem neue Fehlerbeschreibungen eingetragen werden k&ouml;nnen und es stellt eine Liste mit allen bekannten Fehlern zur Verf&uuml;gung. Bitte sehen Sie erst die Liste mit den bekannten Fehlern durch, bevor Sie einen neuen Fehler berichten.</para>
<para>Wenn Sie &kde; 2 benutzen, ist der einfachste Weg zum Berichten eines neuen Fehlers die Benutzung von <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>Berichten Sie Probleme oder W&uuml;nsche...</guimenuitem></menuchoice> aus dem Men&uuml; der jeweiligen Anwendung. Bitte beachten Sie, dass auch hier erwartet wird, dass Sie zuerst die Liste der bekannten Fehler durchsehen, ob dieser Fehler schon berichtet wurde. Der Men&uuml;punkt &ouml;ffnet ein Dialogfeld zur Eingabe der zutreffenden Informationen &uuml;ber den Fehler. Stellen Sie bitte sicher, dass Sie vollst&auml;ndig berichten, was Sie getan haben, bevor der Fehler auftrat, was geschah, nachdem der Fehler auftrat und ob der Fehler reproduzierbar ist und wenn ja, wie Sie diesen Fehler reproduzieren k&ouml;nnen. Wichtig sind au&szlig;erdem Informationen &uuml;ber Betriebssystem und Systemarchitektur (Hardware), sowie die Versionsangaben zu &X; und &kde;.</para>
</answer>
</qandaentry>

<qandaentry>
<question id="programming">
<para>Wo sollten Sie beginnen, wenn Sie ein Programm f&uuml;r &kde; schreiben wollen?</para>
</question>
<answer>
<para>Jedermann ist willkommen, Programme f&uuml;r &kde; zu schreiben. Was Sie zuerst dazu tun m&uuml;ssen, h&auml;ngt stark von Ihren Erfahrungen ab, <abbrev>z.B.</abbrev> ob Sie schon C++ gelernt haben oder ob Sie Erfahrungen mit &Qt; haben usw.</para>
<para>Um in die Programmierung f&uuml;r &kde; einzusteigen, brauchen Sie einige grunds&auml;tzliche Werkzeuge: <application>automake</application>, <application>autoconf</application> und <application>egcs</application>. F&uuml;r weitere Tipps sollten auf folgenden Webseiten nachsehen: <ulink url="http://developer.kde.org/">http://developer.kde.org/</ulink> und <ulink url="http://www.ph.unimelb.edu.au/~ssk/kde/devel/">http://www.ph.unimelb.edu.au/ ~ssk/kde/devel/</ulink>.</para>
<para>Another excellent resource for learning &kde; programming is the &Qt; online tutorials. These are installed along with &Qt;. To view them, open <filename>$<envar>QTDIR</envar>/html/index.html</filename> in &kfm; or &konqueror; and bookmark it. The tutorials can be found under "Using Qt". The source code for each lesson can be found in the <filename class="directory" moreinfo="none">$<envar>QTDIR</envar>/tutorial</filename> directory.</para>
<para>There is, however, one thing that everybody interested in programming for &kde; should do: <emphasis>subscribe to the developers mailing list</emphasis>. To subscribe, you have to send an email to <ulink url="mailto:kde-devel-request@kde.org">kde-devel-request@kde.org</ulink> with the subject <userinput>subscribe <replaceable>your_email_address</replaceable></userinput>. <important><para>Please read <link linkend="subscribe">How to subscribe/unsubscribe to these lists</link> carefully. Everything said there applies to the development list as well.</para></important></para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie erhalten Sie Zugriff auf das <acronym>CVS</acronym>?</para>
</question>
<answer>
<para>Das &kde;-Projekt nutzt das <acronym>CVS</acronym>, um die Kernbestandteile der Software zu entwickeln. Normalerweise, wenn Sie einen dieser Bestandteile ge&auml;ndert haben, (<abbrev>z.B.</abbrev> einen Fehler beseitigten) und Sie m&ouml;chten diese &Auml;nderung dem <acronym>CVS</acronym> zur Verf&uuml;gung stellen, dann ist der beste Weg, die Unterschiede zum derzeitigen Zustand an den Entwickler/Betreuer f&uuml;r das entsprechende Programm zu schicken.</para>
<para>Wenn Sie dies h&auml;ufiger tun, dann k&ouml;nnen Sie auch <ulink url="mailto:coolo@kde.org">Stephan Kulow</ulink> fragen, ob Sie direkten Zugriff auf den <acronym>CVS</acronym>-Server bekommen k&ouml;nnen. Da aber bei steigender Nutzerzahl sich der Zugriff auf den Server f&uuml;r alle Entwickler verlangsamt, wollen wir die Zahl der Nutzer mit direkten Zugriff auf den <acronym>CVS</acronym>-Server m&ouml;glichst klein halten. Fragen kostet jedoch nichts!</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Aus reiner Neugierde; k&ouml;nnen Sie Nur-Lese-Zugriff auf den <acronym>CVS</acronym>-Server erhalten?</para>
</question>
<answer>
<para>Ja, das ist m&ouml;glich mit dem Dienstprogramm <application>cvsup</application>. Sie finden weitere Information dazu unter <ulink url="http://www.kde.org/cvsup.html">How to use <application>cvsup</application> to get &kde;</ulink>.</para>
<para>Zus&auml;tzlich gibt es noch anonymen <acronym>CVS</acronym>-Service. Sie finden weitere Informationen hierzu unter <ulink url="http://www.kde.org/anoncvs.html">dieser Adresse</ulink>.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Gibt es <application>cvsup</application>-Spiegelseiten f&uuml;r &kde;?</para>
</question>
<answer>
<para>Ja. Der &kde;-Hauptserver ist normalerweise ziemlich belastet und reagiert nur langsam. Sehen Sie bitte auf der Webseite <ulink url="http://www.kde.org/cvsupmirrors.html">http://www.kde.org/cvsupmirrors.html</ulink> nach, welche Spiegelserver es gibt</para>  
<para> Once you have selected a new <application>cvsup</application> server, simply replace <screen> 
*default host=cvs.kde.org
</screen> with <screen> 
*default host=cvsup.your.new.host
</screen> in your <application>cvsup</application> script.</para>
</answer>
</qandaentry>

<qandaentry>
<question>
<para>Wie starten Sie mit der &Uuml;bersetzung von &kde; in Ihre Heimatsprache?</para>
</question>
<answer>
<para>Sehen Sie zuerst auf der Seite <ulink url="http://i18n.kde.org">The &kde; Translators' and Documenters' Web Site</ulink> oder der <ulink url="http://i18n.kde.org">deutschen Seite</ulink> nach. Dort finden Sie weitere Informationen und insbesondere eine &Uuml;bersicht, was schon &uuml;bersetzt ist und was nicht (Vieles ist).</para>
</answer>
</qandaentry>
</qandaset>
</chapter>

<chapter id="credits">
<title>Mitwirkende und Lizenz</title>
<!--still has a lot to write-->
<para>Die aktuellen <acronym>FAQ</acronym>-Betreuer sind:</para>

<itemizedlist> <listitem><para>Lee Wee Tiong <email>t29v1051@ip.media.kyoto-u.ac.jp</email></para></listitem> <listitem><para>Michael Demers <email>mdemers@nitemaster.yi.org</email></para></listitem> </itemizedlist>

<para>Viele der Antworten in dieser <acronym>FAQ</acronym> stammen aus den verschiedenen &kde; Mailing Listen und Newsgroups. Hiermit ein <emphasis>gro&szlig;es</emphasis> Dankesch&ouml;n an alle, die mit Antworten beigetragen haben, die schlie&szlig;lich in dieser <acronym>FAQ</acronym> erschienen.</para>

&underFDL;
</chapter>

&documentation.index;
</book>
<!--
Local Variables:
sgml-minimize-attributes: nil
sgml-general-insert-case: lower
End:
-->

